STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
/**
  ******************************************************************************
  * @file    stm32u5xx_hal_ucpd.c
  * @brief   UCPD HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the UCPD peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral State and Errors functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */
#if defined(UCPD1)
/** @addtogroup UCPD
  * @{

# How to use the UCPD HAL module driver

## Usage

1. Declare a hal_ucpd_handle_t handle structure. and initialize the UCPDx driver
   with an UCPD hardware instance by calling the HAL_UCPD_Init().
   The UCPDx clock is enabled inside the HAL_UCPD_Init() if USE_HAL_UCPD_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO.

2. Initialize the UCPD low level resources by implementing the UCPD_MspInit API:
   - Enable the UCPDx interface clock (if not enabled in HAL_UCPD_Init() when UCPD_CLK_ENABLE_MODEL
     is set to CLK_ENABLE_NO)
   - UCPD pins configuration:
     - Enable the clock for the UCPD GPIOs
       - Configure UCPD pins as alternate function open-drain
     - NVIC configuration if you need to use interrupt process
       - Configure the UCPDx interrupt priority
       - Enable the NVIC UCPD IRQ Channel
     - DMA Configuration
       - Declare a hal_dma_handle_t handle structure for the transmit or receive channel
       - Enable the DMAx interface clock
       - Configure the DMA handle parameters
       - Configure the DMA Tx or Rx channel
       - Associate the initialized DMA handle to the hucpd DMA Tx or Rx handle
       - Configure the priority and enable the NVIC for the transfer complete interrupt
         on the DMA Tx or Rx channel

3. Configure the ucpd_clk prescaler, half-bit clock, transition window clock, and inter-frame gap timer division ratios,
   as well as accepted ordered set types and CC line enabling by calling HAL_UCPD_SetConfig().

4. Configure and/or enable advanced static configuration features. For instance, HAL_UCPD_SetRxPreFilterSampling(),
   HAL_UCPD_EnableRxPreFilter(), HAL_UCPD_EnableWakeupMode(), etc.
   All these advanced configurations are optional (not mandatory), and can only be set before starting the driver with
   HAL_UCPD_Start().

5. End the static configuration and start the driver with HAL_UCPD_Start().

6. Apply any dynamic control and configuration function. For instance, HAL_UCPD_SetRole(), HAL_UCPD_SetRxMode(),
   HAL_UCPD_SetTxOrderedSet(), HAL_UCPD_ApplyTrimmingRp(), HAL_UCPD_ApplyTrimmingRd(), etc.

7. For UCPD IO operations, one operation mode is available within this driver:
    - DMA mode IO operation
      - Transmit an amount of data in non-blocking mode (DMA) using HAL_UCPD_Transmit_DMA().
        - At transmission end of transfer, HAL_UCPD_TxCpltCallback() is executed and users can add their own code
          by customization of function pointer HAL_UCPD_TxCpltCallback().

      - Receive an amount of data in non-blocking mode (DMA) using HAL_UCPD_Receive_DMA()
        - HAL_UCPD_Receive_DMA() will also prepare the Tx DMA to quickly allowing transmission of a GoodCRC message.
        - At reception completion, HAL_UCPD_RxCpltCallback() is executed and users can add their own code by
          customization of function pointer HAL_UCPD_RxCpltCallback(). At this point user must prepare the GoodCRC
          data to send by calling HAL_UCPD_SetGoodCRCData().
        - After returning from HAL_UCPD_RxCpltCallback(), quick transmission of GoodCRC message will occur in the
          interrupt context.
        - At GoodCRC transmission end of transfer, HAL_UCPD_TxGoodCRCCpltCallback() is executed and users can add their
          own code by customization of function pointer HAL_UCPD_TxGoodCRCCpltCallback().

      - In case of transfer Error, HAL_UCPD_ErrorCallback() function is executed and users can add their own code by
        customization of function pointer HAL_UCPD_ErrorCallback().

      - Abort an UCPD process communication in Interrupt mode using HAL_UCPD_Abort_IT()
        - At end of abort process, HAL_UCPD_AbortCpltCallback() is executed and users can add their own code by
          customization of function pointer HAL_UCPD_AbortCpltCallback().
        - In case of Tx abort, the UCPD peripheral continues to send the remaining data but will ensure the CRC
          is incorrect, so that the receiver can end the reception and discard the message.

## Callback registration

  - When the compilation flag USE_HAL_UCPD_REGISTER_CALLBACKS is set to 1, it allows the user to configure dynamically
    the driver callbacks instead of weak functions.
    Functions allows to register callbacks:
      - HAL_UCPD_RegisterTxCpltCallback() for transmission end of transfer callback registration.
      - HAL_UCPD_RegisterRxCpltCallback() for reception end of transfer callback registration.
      - HAL_UCPD_RegisterErrorCallback() for error callback registration.
      - etc

## UCPD bus Acquire/Release

  - When the compilation flag USE_HAL_MUTEX is set to 1, it allows the user to acquire/reserve the whole UCPD bus for
    executing process .
    The HAL Acquire/Release are based on the HAL OS abstraction layer:
      - HAL_UCPD_AcquireBus() for acquiring the bus or wait for it.
      - HAL_UCPD_ReleaseBus() for releasing the bus.

  - When the compilation flag USE_HAL_MUTEX is set to 0 or not defined, HAL_UCPD_AcquireBus() / HAL_UCPD_ReleaseBus()
    are not available.

## UCPD driver configuration

Config defines                  | Where            | Default value     | Note
------------------------------- | ---------------- | ----------------- | --------------------------------------------
USE_HAL_UCPD_MODULE             | hal_conf.h       |        1U         | Enable HAL UCPD module
USE_HAL_UCPD_POWER_DELIVERY     | hal_conf.h       |        1U         | Enable the PD related functions in the driver
USE_HAL_UCPD_REGISTER_CALLBACKS | hal_conf.h       |        0U         | Enable the register callbacks assert
USE_HAL_UCPD_CLK_ENABLE_MODEL   | hal_conf.h       | HAL_CLK_ENABLE_NO | Enable peripheral clock in the HAL_UCPD_Init
USE_HAL_UCPD_USER_DATA          | hal_conf.h       |        0U         | Add an user data inside HAL UCPD handle
USE_HAL_UCPD_GET_LAST_ERRORS    | hal_conf.h       |        0U         | Add error member inside HAL UCPD handle
USE_HAL_CHECK_PARAM             | hal_conf.h       |        0U         | Enable checking of vital parameters at runtime
USE_HAL_MUTEX                   | hal_conf.h       |        0U         | Enable the use of semaphore in the HAL driver
USE_ASSERT_DBG_PARAM            | PreProcessor env |        NA         | Enable the params assert
USE_ASSERT_DBG_STATE            | PreProcessor env |        NA         | Enable the state assert
  */

#if defined(USE_HAL_UCPD_MODULE) && (USE_HAL_UCPD_MODULE == 1)

/* Private types -----------------------------------------------------------*/
/** @defgroup UCPD_Private_Types UCPD Private Types
  * @{
  */

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup UCPD_Private_Constants UCPD Private Constants
  * @{
  */

/**
  * @brief Receiver ordered set mask
  */
#define HAL_UCPD_RXORDSET_MASK ((uint32_t)0x1FF00000U)

/**
  * @brief Min size in bytes of a message transmission
  */
#define HAL_UCPD_MIN_MESSAGE_SIZE (2U)

/**
  * @brief Size in bytes of a GoodCRC message
  */
#define HAL_UCPD_GOODCRC_SIZE (HAL_UCPD_MIN_MESSAGE_SIZE)

/**
  * @brief All active states
  */
#define UCPD_STATE_ALL_ACTIVE (((uint32_t) HAL_UCPD_STATE_IDLE)     \
                               | ((uint32_t) HAL_UCPD_STATE_TX)     \
                               | ((uint32_t) HAL_UCPD_STATE_RX)     \
                               | ((uint32_t) HAL_UCPD_STATE_ABORT))
/**
  * @brief All states except init
  */
#define UCPD_STATE_ALL_EXCEPT_INIT (((uint32_t) HAL_UCPD_STATE_CONFIGURED) \
                                    | ((uint32_t) UCPD_STATE_ALL_ACTIVE))
/**
  * @brief All states except init and abort
  */
#define UCPD_STATE_ALL_EXCEPT_INIT_AND_ABORT (((uint32_t) HAL_UCPD_STATE_CONFIGURED) \
                                              | ((uint32_t) HAL_UCPD_STATE_IDLE)     \
                                              | ((uint32_t) HAL_UCPD_STATE_TX)       \
                                              | ((uint32_t) HAL_UCPD_STATE_RX))
/**
  * @brief All states
  */
#define UCPD_STATE_ALL (((uint32_t) HAL_UCPD_STATE_INIT)           \
                        | ((uint32_t) UCPD_STATE_ALL_EXCEPT_INIT))

/**
  * @}
  */

/* Private macros -------------------------------------------------------------*/
/** @defgroup UCPD_Private_Macros UCPD Private Macros
  * @{
  */

/**
  * @brief  Check UCPD clock prescaler value
  * @param  psc Prescaler for producing ucpd_clk from ucpd_ker_ck
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_PSC(psc) (((psc) == HAL_UCPD_PSC_DIV1)     \
                          || ((psc) == HAL_UCPD_PSC_DIV2)  \
                          || ((psc) == HAL_UCPD_PSC_DIV4)  \
                          || ((psc) == HAL_UCPD_PSC_DIV8)  \
                          || ((psc) == HAL_UCPD_PSC_DIV16))

/**
  * @brief  Check half-bit clock divider value
  * @param  hbit_div Divider for producing half-bit clock (hbit_clk) from ucpd_clk
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_HBITCLK_DIV(hbit_div) (((hbit_div) == HAL_UCPD_HBITCLK_DIV1)      \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV2)   \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV3)   \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV4)   \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV5)   \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV6)   \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV7)   \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV8)   \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV9)   \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV10)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV11)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV12)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV13)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV14)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV15)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV16)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV17)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV18)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV19)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV20)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV21)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV22)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV23)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV24)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV25)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV26)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV27)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV28)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV29)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV30)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV31)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV32)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV33)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV34)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV35)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV36)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV37)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV38)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV39)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV40)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV41)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV42)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV43)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV44)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV45)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV46)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV47)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV48)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV49)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV50)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV51)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV52)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV53)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV54)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV55)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV56)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV57)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV58)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV59)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV60)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV61)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV62)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV63)  \
                                       || ((hbit_div) == HAL_UCPD_HBITCLK_DIV64))

/**
  * @brief  Check transition window clock divider value
  * @param  transwin_div Divider for producing transition window clock from half-bit clock (hbit_clk)
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_TRANSWIN_DIV(transwin_div) (((transwin_div) == HAL_UCPD_TRANSWIN_DIV2)      \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV3)   \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV4)   \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV5)   \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV6)   \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV7)   \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV8)   \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV9)   \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV10)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV11)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV12)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV13)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV14)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV15)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV16)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV17)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV18)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV19)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV20)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV21)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV22)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV23)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV24)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV25)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV26)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV27)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV28)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV29)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV30)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV31)  \
                                            || ((transwin_div) == HAL_UCPD_TRANSWIN_DIV32))

/**
  * @brief  Check inter-frame gap timer clock divider value
  * @param  ifrgap_div Divider for producing inter-frame gap timer clock from ucpd_clk
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_IRFGAP_DIV(ifrgap_div) (((ifrgap_div) == HAL_UCPD_IFRGAP_DIV2)      \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV3)   \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV4)   \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV5)   \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV6)   \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV7)   \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV8)   \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV9)   \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV10)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV11)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV12)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV13)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV14)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV15)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV16)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV17)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV18)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV19)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV20)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV21)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV22)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV23)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV24)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV25)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV26)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV27)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV28)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV29)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV30)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV31)  \
                                        || ((ifrgap_div) == HAL_UCPD_IFRGAP_DIV32))

/**
  * @brief  Check Tx mode value
  * @param  txmode Tx mode
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_TX_MODE(txmode) (((txmode) == HAL_UCPD_TX_MODE_NORMAL)         \
                                 || ((txmode) == HAL_UCPD_TX_MODE_CABLE_RESET) \
                                 || ((txmode) == HAL_UCPD_TX_MODE_BIST))

/**
  * @brief  Check Rx mode value
  * @param  rxmode Rx mode
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_RX_MODE(rxmode) (((rxmode) == HAL_UCPD_RX_MODE_NORMAL)   \
                                 || ((rxmode) == HAL_UCPD_RX_MODE_BIST))

/**
  * @brief  Check role value
  * @param  role Analog PHY operating role
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_ROLE(role) (((role) == HAL_UCPD_ROLE_SOURCE)   \
                            || ((role) == HAL_UCPD_ROLE_SINK))

/**
  * @brief  Check Rp resistor value
  * @param  rp Rp resistor values
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_RP_VALUE(rp) (((rp) == HAL_UCPD_RP_DEFAULT)  \
                              || ((rp) == HAL_UCPD_RP_1_5A)  \
                              || ((rp) == HAL_UCPD_RP_3_0A)  \
                              || ((rp) == HAL_UCPD_RP_NONE))

/**
  * @brief  Check Rx ordered set value
  * @param  rxordset Rx ordered set
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_RXORDSET_TYPE(rxordset) (((rxordset) & (HAL_UCPD_RXORDSET_MASK)) == (rxordset))

/**
  * @brief  Check Tx ordered set value
  * @param  txordset Tx ordered set
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_TXORDSET_TYPE(txordset) (((txordset) == HAL_UCPD_TX_ORDERED_SET_SOP)           \
                                         || ((txordset) == HAL_UCPD_TX_ORDERED_SET_SOP1)       \
                                         || ((txordset) == HAL_UCPD_TX_ORDERED_SET_SOP2)       \
                                         || ((txordset) == HAL_UCPD_TX_ORDERED_SET_SOP1_DEBUG) \
                                         || ((txordset) == HAL_UCPD_TX_ORDERED_SET_SOP2_DEBUG) \
                                         || ((txordset) == HAL_UCPD_TX_ORDERED_SET_HARD_RST)   \
                                         || ((txordset) == HAL_UCPD_TX_ORDERED_SET_CABLE_RST))

