STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
/**
  * @brief  Check CC line enable value
  * @param  cc_en CC line enable value
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_CC_LINE_EN(cc_en) (((cc_en) == HAL_UCPD_CC_ENABLE_NONE)       \
                                   || ((cc_en) == HAL_UCPD_CC_ENABLE_CC1)     \
                                   || ((cc_en) == HAL_UCPD_CC_ENABLE_CC2)     \
                                   || ((cc_en) == HAL_UCPD_CC_ENABLE_CC1CC2))

/**
  * @brief  Check CC line
  * @param  cc_line CC line
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_CC_LINE(cc_line) (((cc_line) == HAL_UCPD_LINE_CC1)     \
                                  || ((cc_line) == HAL_UCPD_LINE_CC2))

/**
  * @brief  Check BMC decoder Rx pre-filter sampling method
  * @param  rx_prefilt_samples BMC decoder Rx pre-filter sampling method
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_RX_PREFILT_SAMPLE(rx_prefilt_samples) (((rx_prefilt_samples) == HAL_UCPD_RX_PREFILTER_3SAMPLES)     \
                                                       || ((rx_prefilt_samples) == HAL_UCPD_RX_PREFILTER_2SAMPLES))

/**
  * @brief  Check Rp value for trimming
  * @param  trim_rp_value Rp value to apply trimming to.
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_TRIM_RP(trim_rp_value) (((trim_rp_value) == HAL_UCPD_TRIM_RP_1_5A)     \
                                        || ((trim_rp_value) == HAL_UCPD_TRIM_RP_3_0A))


/**
  * @brief  Check if the transfer size is valid
  * @param  size_byte Number of bytes for the transfer
  * @retval true (valid) or false (invalid)
  */
#define IS_UCPD_TRANSFER_SIZE(size_byte)        (((size_byte) < 0xFFFF) && (size_byte) >= HAL_UCPD_MIN_MESSAGE_SIZE)

/**
  * @brief Retrieve UCPD instance from handle
  */
#define UCPD_GET_INSTANCE(handle) \
  ((UCPD_TypeDef *)((uint32_t)((handle)->instance)))

/* Bits definition for UCPD Trimming register */
#define UCPD_VALUE_TRIM_CC1_RP_3A0_POS  (0U)                                      /*!< Trim data position for Rp 3.0A (CC1)          */
#define UCPD_VALUE_TRIM_CC1_RP_3A0_MSK  (0xFUL << UCPD_VALUE_TRIM_CC1_RP_3A0_POS) /*!< Trim data mask for Rp 3.0A (CC1) - 0x0000000F */
#define UCPD_VALUE_TRIM_CC1_RP_3A0      UCPD_VALUE_TRIM_CC1_RP_3A0_MSK            /*!< Trim data value for Rp 3.0A (CC1)             */
#define UCPD_VALUE_TRIM_CC1_RP_1A5_POS  (0U)                                      /*!< Trim data position for Rp 1.5A (CC1)          */
#define UCPD_VALUE_TRIM_CC1_RP_1A5_MSK  (0xFUL << UCPD_VALUE_TRIM_CC1_RP_1A5_POS) /*!< Trim data mask for Rp 1.5A (CC1) - 0x0000000F */
#define UCPD_VALUE_TRIM_CC1_RP_1A5      UCPD_VALUE_TRIM_CC1_RP_1A5_MSK            /*!< Trim data value for Rp 1.5A (CC1)             */
#define UCPD_VALUE_TRIM_CC1_RD_POS      (0U)                                      /*!< Trim data position for Rd (CC1)               */
#define UCPD_VALUE_TRIM_CC1_RD_MSK      (0xFUL << UCPD_VALUE_TRIM_CC1_RD_POS)     /*!< Trim data mask for Rd (CC1)      - 0x0000000F */
#define UCPD_VALUE_TRIM_CC1_RD          UCPD_VALUE_TRIM_CC1_RD_MSK                /*!< Trim data value for Rd (CC1)                  */
#define UCPD_VALUE_TRIM_CC2_RP_3A0_POS  (0U)                                      /*!< Trim data position for Rp 3.0A (CC2)          */
#define UCPD_VALUE_TRIM_CC2_RP_3A0_MSK  (0xFUL << UCPD_VALUE_TRIM_CC2_RP_3A0_POS) /*!< Trim data mask for Rp 3.0A (CC2) - 0x0000000F */
#define UCPD_VALUE_TRIM_CC2_RP_3A0      UCPD_VALUE_TRIM_CC2_RP_3A0_MSK            /*!< Trim data value for Rp 3.0A (CC2)             */
#define UCPD_VALUE_TRIM_CC2_RP_1A5_POS  (0U)                                      /*!< Trim data position for Rp 1.5A (CC2)          */
#define UCPD_VALUE_TRIM_CC2_RP_1A5_MSK  (0xFUL << UCPD_VALUE_TRIM_CC2_RP_1A5_POS) /*!< Trim data mask for Rp 1.5A (CC2) - 0x0000000F */
#define UCPD_VALUE_TRIM_CC2_RP_1A5      UCPD_VALUE_TRIM_CC2_RP_1A5_MSK            /*!< Trim data value for Rp 1.5A (CC2)             */
#define UCPD_VALUE_TRIM_CC2_RD_POS      (0U)                                      /*!< Trim data position for Rd (CC2)               */
#define UCPD_VALUE_TRIM_CC2_RD_MSK      (0xFUL << UCPD_VALUE_TRIM_CC2_RD_POS)     /*!< Trim data mask for Rd (CC2)      - 0x0000000F */
#define UCPD_VALUE_TRIM_CC2_RD          UCPD_VALUE_TRIM_CC2_RD_MSK                /*!< Trim data value for Rd (CC2)                  */


/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup UCPD_Private_Functions UCPD Private Functions
  * @{
  */
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
static void UCPD_EndTxTransfer(hal_ucpd_handle_t *hucpd);
static void UCPD_EndRxTransfer(hal_ucpd_handle_t *hucpd);

static void UCPD_DMATransmitCplt(hal_dma_handle_t *hdma);
static void UCPD_DMAReceiveCplt(hal_dma_handle_t *hdma);
static void UCPD_DMAError(hal_dma_handle_t *hdma);

static void UCPD_DMATxAbortCallback(hal_dma_handle_t *hdma);
static void UCPD_DMARxAbortCallback(hal_dma_handle_t *hdma);

static void UCPD_DMAEndTxMsgAbortCallback(hal_dma_handle_t *hdma);
static void UCPD_DMAEndTxMsgDiscardCallback(hal_dma_handle_t *hdma);
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @defgroup UCPD_Private_Variables UCPD Private Variables
  * @{
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup UCPD_Exported_Functions
  * @{
  */

/** @addtogroup UCPD_Exported_Functions_Group1
  * @{

A set of functions allowing to initialize and deinitialize the UCPDx peripheral:
  - HAL_UCPD_Init() to initialize the selected UCPDx handle and associate an instance.
  - HAL_UCPD_DeInit() to restore the default configuration of the selected UCPDx peripheral.
  */

/**
  * @brief  Initialize the UCPD according to the associated handle.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  instance UCPD instance.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         UCPD instance is already initialized and cannot be modified
  *                           or semaphore creation failed (USE_HAL_MUTEX is set to 1).
  * @retval HAL_OK            UCPD instance has been correctly initialized.
  */
hal_status_t HAL_UCPD_Init(hal_ucpd_handle_t *hucpd, hal_ucpd_t instance)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hucpd != NULL);
  ASSERT_DBG_PARAM(IS_UCPD_ALL_INSTANCE((UCPD_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check the handle struct pointer */
  if (hucpd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hucpd->instance = instance;

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  hucpd->hdma_tx = NULL;
  hucpd->hdma_rx = NULL;
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

#if defined(USE_HAL_UCPD_CLK_ENABLE_MODEL) && (USE_HAL_UCPD_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  if (hucpd->instance == HAL_UCPD1)
  {
    HAL_RCC_UCPD1_EnableClock();
  }

