STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
#endif /* USE_HAL_UCPD_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO */

#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1U)
  /* Init the UCPD Callback settings */
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  hucpd->p_tx_cplt_cb          = HAL_UCPD_TxCpltCallback;        /* Tx message sent callback               */
  hucpd->p_tx_goodcrc_cplt_cb  = HAL_UCPD_TxGoodCRCCpltCallback; /* Tx GoodCRC message sent callback       */
  hucpd->p_tx_discard_cb       = HAL_UCPD_TxDiscardCallback;     /* Tx message discarded callback          */
  hucpd->p_tx_abort_cb         = HAL_UCPD_TxAbortCallback;       /* Tx message aborted callback            */
  hucpd->p_rx_cptl_cb          = HAL_UCPD_RxCpltCallback;        /* Rx complete callback                   */
  hucpd->p_rx_ord_set_cb       = HAL_UCPD_RxOrdDetCallback;      /* Rx ordered set detected callback       */
  hucpd->p_hrst_sent_cb        = HAL_UCPD_HRstSentCallback;      /* Hard reset sent callback               */
  hucpd->p_hrst_rx_cb          = HAL_UCPD_HRstRxCallback;        /* Hard reset received callback           */
  hucpd->p_hrst_discard_cb     = HAL_UCPD_HRstDiscardCallback;   /* Hard reset discarded callback          */
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
  hucpd->p_type_c_event_ccx_cb = HAL_UCPD_TypeCEventCCxCallback; /* Type-C event on CCx callback           */
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  hucpd->p_frs_evt_cb          = HAL_UCPD_FRSEvtCallback;        /* Fast Role Swap event detected callback */
  hucpd->p_abort_cplt_cb       = HAL_UCPD_AbortCpltCallback;     /* Abort complete callback                */
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
  hucpd->p_error_cb            = HAL_UCPD_ErrorCallback;         /* Error callback                         */
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */

#if defined (USE_HAL_UCPD_USER_DATA) && (USE_HAL_UCPD_USER_DATA == 1)
  /* Reset the user data pointer */
  hucpd->p_user_data = NULL;
#endif /* USE_HAL_UCPD_USER_DATA */

#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
  hucpd->last_error_codes = HAL_UCPD_ERROR_NONE;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  /* Create the UCPD semaphore */
  if (HAL_OS_SemaphoreCreate(&hucpd->semaphore) != HAL_OS_OK)
  {
    return HAL_ERROR;
  }
#endif /* USE_HAL_MUTEX */

  /* Initialize the global state */
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  hucpd->previous_state = hucpd->global_state;
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
  hucpd->global_state = HAL_UCPD_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief  Deinitialize the UCPD peripheral.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
void HAL_UCPD_DeInit(hal_ucpd_handle_t *hucpd)
{
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  UCPD_TypeDef *p_ucpdx;
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

  /* Check the UCPD handle allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL);

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Check if any transfer ongoing */
  if (((uint32_t)hucpd->global_state & ((uint32_t)HAL_UCPD_STATE_TX | (uint32_t)HAL_UCPD_STATE_RX)) != 0U)
  {
    /* Disable all UCPD interrupts */
    LL_UCPD_DisableIT_FRS(p_ucpdx);
    LL_UCPD_DisableIT_TypeCEventCC2(p_ucpdx);
    LL_UCPD_DisableIT_TypeCEventCC1(p_ucpdx);
    LL_UCPD_DisableIT_RxMsgEnd(p_ucpdx);
    LL_UCPD_DisableIT_RxOvr(p_ucpdx);
    LL_UCPD_DisableIT_RxHRST(p_ucpdx);
    LL_UCPD_DisableIT_RxOrderSet(p_ucpdx);
    LL_UCPD_DisableIT_TxUND(p_ucpdx);
    LL_UCPD_DisableIT_TxHRSTSENT(p_ucpdx);
    LL_UCPD_DisableIT_TxHRSTDISC(p_ucpdx);
    LL_UCPD_DisableIT_TxMSGABT(p_ucpdx);
    LL_UCPD_DisableIT_TxMSGSENT(p_ucpdx);
    LL_UCPD_DisableIT_TxMSGDISC(p_ucpdx);

    /* Stop current process/operation(s) */
    if (LL_UCPD_IsEnabledTxDMA(p_ucpdx) == 1U)
    {
      if (hucpd->hdma_tx != NULL)
      {
        if (hucpd->hdma_tx->global_state == HAL_DMA_STATE_ACTIVE)
        {
          hucpd->hdma_tx->p_xfer_abort_cb = UCPD_DMATxAbortCallback;
          /* Abort DMA Tx */
          if (HAL_DMA_Abort_IT(hucpd->hdma_tx) != HAL_OK)
          {
            hucpd->hdma_tx->p_xfer_abort_cb = NULL;
          }
        }
      }
    }

    if (LL_UCPD_IsEnabledRxDMA(p_ucpdx) == 1U)
    {
      if (hucpd->hdma_rx != NULL)
      {
        if (hucpd->hdma_rx->global_state == HAL_DMA_STATE_ACTIVE)
        {
          hucpd->hdma_rx->p_xfer_abort_cb = UCPD_DMARxAbortCallback;
          /* Abort DMA Rx */
          if (HAL_DMA_Abort_IT(hucpd->hdma_rx) != HAL_OK)
          {
            hucpd->hdma_rx->p_xfer_abort_cb = NULL;
          }
        }
      }
    }
  }
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

  /* Disable UCPD peripheral */
  LL_UCPD_Disable(UCPD_GET_INSTANCE(hucpd));

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  /* Reset internal fields */
  hucpd->hdma_tx              = (hal_dma_handle_t *) NULL;
  hucpd->hdma_rx              = (hal_dma_handle_t *) NULL;
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

#if defined(USE_HAL_UCPD_USER_DATA) && (USE_HAL_UCPD_USER_DATA == 1)
  /* Reset the userdata pointer */
  hucpd->p_user_data          = NULL;
#endif /* USE_HAL_UCPD_USER_DATA */

#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
  /* Reset the last_error_codes variable storing the last errors */
  hucpd->last_error_codes     = HAL_UCPD_ERROR_NONE;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  /* Delete the UCPD semaphore */
  (void)HAL_OS_SemaphoreDelete(&hucpd->semaphore);
#endif /* USE_UCPD_MUTEX  */

  /* Reset the global state and previous state */
  hucpd->global_state = HAL_UCPD_STATE_RESET;
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  hucpd->previous_state = HAL_UCPD_STATE_RESET;
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
}

/**
  * @}
  */

/** @addtogroup UCPD_Exported_Functions_Group2
  * @{

A set of functions allowing to configure the UCPDx peripheral:

