STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
- Global configuration
  - HAL_UCPD_SetConfig()
  - HAL_UCPD_GetConfig()

- Rx ordered sets
  - HAL_UCPD_SetRxOrderedSet()
  - HAL_UCPD_GetRxOrderedSet()

- Rx/Tx DMA management
  - HAL_UCPD_SetRxDMA()
  - HAL_UCPD_SetTxDMA()

- Wake-up from Stop mode
  - HAL_UCPD_EnableWakeupMode()
  - HAL_UCPD_DisableWakeupMode()
  - HAL_UCPD_IsEnabledWakeupMode()

- Software trimming
  - HAL_UCPD_ApplyTrimmingRp()
  - HAL_UCPD_ApplyTrimmingRd()

- Start/Stop
  - HAL_UCPD_Start()
  - HAL_UCPD_Stop()

  */

/**
  * @brief  Configure the UCPD according to the user parameters.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_config Pointer to a @ref hal_ucpd_config_t structure that contains the UCPD configuration.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_SetConfig(hal_ucpd_handle_t *hucpd, const hal_ucpd_config_t *p_config)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_CONFIGURED);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check the configuration pointer */
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check function parameters */
  ASSERT_DBG_PARAM(IS_UCPD_PSC(p_config->clk_psc));
  ASSERT_DBG_PARAM(IS_UCPD_HBITCLK_DIV(p_config->hbitclk_div));
  ASSERT_DBG_PARAM(IS_UCPD_TRANSWIN_DIV(p_config->transwin_div));
  ASSERT_DBG_PARAM(IS_UCPD_IRFGAP_DIV(p_config->ifrgap_div));
  ASSERT_DBG_PARAM(IS_UCPD_RXORDSET_TYPE(p_config->rx_ordered_set));

  /* Disable the UCPD peripheral */
  LL_UCPD_Disable(p_ucpdx);

  /* Set the clock prescaler */
  LL_UCPD_SetPSCClk(p_ucpdx, (uint32_t)p_config->clk_psc);

  /* Set the half-bit clock divider */
  LL_UCPD_SetHbitClockDiv(p_ucpdx, (uint32_t)p_config->hbitclk_div);

  /* Set the transition window clock divider */
  LL_UCPD_SetTransWin(p_ucpdx, (uint32_t)p_config->transwin_div);

  /* Set the inter-frame gap timer clock divider */
  LL_UCPD_SetIfrGap(p_ucpdx, (uint32_t)p_config->ifrgap_div);

  /* Set the receiver accepted ordered set types */
  LL_UCPD_SetRxOrderSet(p_ucpdx, (uint32_t)p_config->rx_ordered_set);

  /* Go to configured state */
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  hucpd->previous_state = hucpd->global_state;
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
  hucpd->global_state = HAL_UCPD_STATE_CONFIGURED;

  return HAL_OK;
}

/**
  * @brief  Get the UCPD configuration.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_config Pointer to a @ref hal_ucpd_config_t structure that contains the UCPD configuration.
  */
void HAL_UCPD_GetConfig(const hal_ucpd_handle_t *hucpd, hal_ucpd_config_t *p_config)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Set the clock prescaler */
  p_config->clk_psc = (hal_ucpd_clk_prescaler_t)LL_UCPD_GetPSCClk(p_ucpdx);

  /* Set the half-bit clock divider */
  p_config->hbitclk_div = (hal_ucpd_half_bit_clk_divider_t)LL_UCPD_GetHbitClockDiv(p_ucpdx);

  /* Set the transition window clock divider */
  p_config->transwin_div = (hal_ucpd_transition_window_divider_t)LL_UCPD_GetTransWin(p_ucpdx);

  /* Set the inter-frame gap timer clock divider */
  p_config->ifrgap_div = (hal_ucpd_inter_frame_gap_divider_t)LL_UCPD_GetIfrGap(p_ucpdx);

  /* Set the receiver accepted ordered set types */
  p_config->rx_ordered_set = (uint32_t)LL_UCPD_GetRxOrderSet(p_ucpdx);
}

/**
  * @brief  Set the type(s) of ordered set(s) that the receiver must detect.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  rx_ordered_set Type(s) of ordered set(s) that the receiver must detect.
  *         This parameter can be any combination of the following values:
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_NONE
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP1
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP2
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_HARD_RST
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_CABLE_RST
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP1_DEBUG
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP2_DEBUG
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP_EXT1
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP_EXT2
  * @warning This function modifies a static configuration, and therefore must not be called after HAL_UCPD_Start().
  * @retval HAL_ERROR UCPD instance is already configured and cannot be modified.
  * @retval HAL_OK    UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_SetRxOrderedSet(hal_ucpd_handle_t *hucpd, uint32_t rx_ordered_set)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Check function parameters */
  ASSERT_DBG_PARAM(IS_UCPD_RXORDSET_TYPE(rx_ordered_set));

  /* Set the receiver accepted ordered set types */
  LL_UCPD_SetRxOrderSet(p_ucpdx, rx_ordered_set);

  if (rx_ordered_set != HAL_UCPD_RX_ORDERED_SET_NONE)
  {
    /* Enable the Rx ordered set interrupt */
    LL_UCPD_EnableIT_RxOrderSet(p_ucpdx);
  }
  else
  {
    /* Disable the Rx ordered set interrupt */
    LL_UCPD_DisableIT_RxOrderSet(p_ucpdx);
  }

  return HAL_OK;
}

/**
  * @brief  Get the types of ordered sets that the receiver must detect.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return Enabled ordered sets. This can be any combination of the following values:
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP1
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP2
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_HARD_RST
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_CABLE_RST
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP1_DEBUG
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP2_DEBUG
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP_EXT1
  *         @arg @ref HAL_UCPD_RX_ORDERED_SET_SOP_EXT2
  */
uint32_t HAL_UCPD_GetRxOrderedSet(hal_ucpd_handle_t *hucpd)
{
  uint32_t rx_ordered_set;

