STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get the receiver accepted ordered set types */
  rx_ordered_set = (uint32_t)LL_UCPD_GetRxOrderSet(UCPD_GET_INSTANCE(hucpd));

  return rx_ordered_set;
}

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/**
  * @brief  Set DMA channel for reception.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure which contains the UCPD instance.
  * @param  hdma_rx Pointer to a hal_dma_handle_t structure which contains the DMA instance
  * @retval HAL_OK            DMA channel has been correctly set.
  * @retval HAL_INVALID_PARAM hdma_rx is NULL.
  */
hal_status_t HAL_UCPD_SetRxDMA(hal_ucpd_handle_t *hucpd, hal_dma_handle_t *hdma_rx)
{
  ASSERT_DBG_PARAM(hucpd != NULL);
  ASSERT_DBG_PARAM(hdma_rx != NULL);

  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check input parameter */
  if (hdma_rx == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hucpd->hdma_rx = hdma_rx;
  hdma_rx->p_parent = hucpd;

  return HAL_OK;
}

/**
  * @brief  Set DMA channel for transmission.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure which contains the UCPD instance.
  * @param  hdma_tx Pointer to a hal_dma_handle_t structure which contains the DMA instance
  * @retval HAL_OK            DMA channel has been correctly set.
  * @retval HAL_INVALID_PARAM hdma_tx is NULL.
  */
hal_status_t HAL_UCPD_SetTxDMA(hal_ucpd_handle_t *hucpd, hal_dma_handle_t *hdma_tx)
{
  ASSERT_DBG_PARAM(hucpd != NULL);
  ASSERT_DBG_PARAM(hdma_tx != NULL);

  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check input parameter */
  if (hdma_tx == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hucpd->hdma_tx = hdma_tx;
  hdma_tx->p_parent = hucpd;

  return HAL_OK;
}
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @brief  Enable the UCPD receiver hardware analog filter.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @warning This function modifies a static configuration, and therefore must not be called after HAL_UCPD_Start().
  * @retval HAL_ERROR UCPD instance is already configured and cannot be modified.
  * @retval HAL_OK    UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_EnableRxAnalogFilter(hal_ucpd_handle_t *hucpd)
{
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

  /* Enable the Rx analog filter */
  LL_UCPD_RxAnalogFilterEnable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Disable the UCPD receiver hardware analog filter.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @warning This function modifies a static configuration, and therefore must not be called after HAL_UCPD_Start().
  * @retval HAL_ERROR UCPD instance is already configured and cannot be modified.
  * @retval HAL_OK    UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_DisableRxAnalogFilter(hal_ucpd_handle_t *hucpd)
{
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

  /* Disable the Rx analog filter */
  LL_UCPD_RxAnalogFilterDisable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Return the UCPD receiver hardware analog filter.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_rx_analog_filter_status_t Receiver hardware analog filter status.
  */
hal_ucpd_rx_analog_filter_status_t HAL_UCPD_IsEnabledRxAnalogFilter(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_rx_analog_filter_status_t status;

  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get the Rx analog filter status */
  status = (hal_ucpd_rx_analog_filter_status_t)LL_UCPD_IsEnabledRxAnalogFilter(UCPD_GET_INSTANCE(hucpd));

  return status;
}

/**
  * @brief  Enable UCPD wake-up from Stop mode.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @warning This function modifies a static configuration, and therefore must not be called after HAL_UCPD_Start().
  * @retval HAL_ERROR UCPD instance is already configured and cannot be modified.
  * @retval HAL_OK    UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_EnableWakeupMode(hal_ucpd_handle_t *hucpd)
{
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

  /* Enable wake-up from Stop mode */
  LL_UCPD_WakeUpEnable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Disable UCPD wake-up from Stop mode.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @warning This function modifies a static configuration, and therefore must not be called after HAL_UCPD_Start().
  * @retval HAL_ERROR UCPD instance is already configured and cannot be modified.
  * @retval HAL_OK    UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_DisableWakeupMode(hal_ucpd_handle_t *hucpd)
{
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

  /* Disable wake-up from Stop mode */
  LL_UCPD_WakeUpDisable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Return UCPD wake-up from Stop mode status.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_wakeup_mode_status_t Wake-up from stop mode status.
  */
hal_ucpd_wakeup_mode_status_t HAL_UCPD_IsEnabledWakeupMode(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_wakeup_mode_status_t status;

