STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get wake-up mode status */
  status = (hal_ucpd_wakeup_mode_status_t)LL_UCPD_IsEnabledWakeUp(UCPD_GET_INSTANCE(hucpd));

  return status;
}

/**
  * @brief  Enable UCPD ClkReq clock request forcing.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @warning This function modifies a static configuration, and therefore must not be called after HAL_UCPD_Start().
  * @retval HAL_ERROR UCPD instance is already configured and cannot be modified.
  * @retval HAL_OK    UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_EnableForceClock(hal_ucpd_handle_t *hucpd)
{
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

  /* Enable ClkReq clock request forcing */
  LL_UCPD_ForceClockEnable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Disable UCPD ClkReq clock request forcing.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @warning This function modifies a static configuration, and therefore must not be called after HAL_UCPD_Start().
  * @retval HAL_ERROR UCPD instance is already configured and cannot be modified.
  * @retval HAL_OK    UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_DisableForceClock(hal_ucpd_handle_t *hucpd)
{
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

  /* Disable ClkReq clock request forcing */
  LL_UCPD_ForceClockDisable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Return UCPD ClkReq clock request forcing status.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_force_clk_status_t ClkReq clock request forcing status.
  */
hal_ucpd_force_clk_status_t HAL_UCPD_IsEnabledForceClock(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_force_clk_status_t status;

  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get ClkReq clock request forcing status */
  status = (hal_ucpd_force_clk_status_t)LL_UCPD_IsEnabledForceClock(UCPD_GET_INSTANCE(hucpd));

  return status;
}

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/**
  * @brief  Set the BMC decoder Rx pre-filter sampling method.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  rx_prefilter_samples BMC decoder Rx pre-filter sampling method.
  * @warning This function modifies a static configuration, and therefore must not be called after HAL_UCPD_Start().
  * @retval HAL_ERROR UCPD instance is already configured and cannot be modified.
  * @retval HAL_OK    UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_SetRxPreFilterSampling(hal_ucpd_handle_t *hucpd,
                                             hal_ucpd_rx_prefilter_samples_t rx_prefilter_samples)
{
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

  /* Check function parameters */
  ASSERT_DBG_PARAM(IS_UCPD_RX_PREFILT_SAMPLE(rx_prefilter_samples));

  /* Apply Rx pre-filter sampling method */
  LL_UCPD_SetRxPreFilterSampling(UCPD_GET_INSTANCE(hucpd), (uint32_t)rx_prefilter_samples);

  return HAL_OK;
}

/**
  * @brief  Get the BMC decoder Rx pre-filter sampling method.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_rx_prefilter_samples_t BMC decoder Rx pre-filter sampling method.
  */
hal_ucpd_rx_prefilter_samples_t HAL_UCPD_GetRxPreFilterSampling(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_rx_prefilter_samples_t rx_prefilter_samples;

  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get Rx pre-filter sampling method */
  rx_prefilter_samples = (hal_ucpd_rx_prefilter_samples_t)LL_UCPD_GetRxPreFilterSampling(UCPD_GET_INSTANCE(hucpd));

  return rx_prefilter_samples;
}

/**
  * @brief  Enable UCPD Rx pre-filter.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @warning This function modifies a static configuration, and therefore must not be called after HAL_UCPD_Start().
  * @retval HAL_ERROR UCPD instance is already configured and cannot be modified.
  * @retval HAL_OK    UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_EnableRxPreFilter(hal_ucpd_handle_t *hucpd)
{
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);
  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

  /* Enable Rx pre-filter */
  LL_UCPD_RxPreFilterEnable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Disable UCPD Rx pre-filter.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @warning This function modifies a static configuration, and therefore must not be called after HAL_UCPD_Start().
  * @retval HAL_ERROR UCPD instance is already configured and cannot be modified.
  * @retval HAL_OK    UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_DisableRxPreFilter(hal_ucpd_handle_t *hucpd)
{
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

  /* Disable Rx pre-filter */
  LL_UCPD_RxPreFilterDisable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Return UCPD Rx pre-filter status.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_rx_prefilter_status_t Rx pre-filter status.
  */
hal_ucpd_rx_prefilter_status_t HAL_UCPD_IsEnabledRxPreFilter(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_rx_prefilter_status_t status;

