STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get Rx pre-filter status */
  status = (hal_ucpd_rx_prefilter_status_t)LL_UCPD_IsEnabledRxPreFilter(UCPD_GET_INSTANCE(hucpd));

  return status;
}
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @brief  Apply the Rp current sources trimming on both CC lines.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  trim_rp_value Rp value to apply trimming to.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_ApplyTrimmingRp(hal_ucpd_handle_t *hucpd, hal_ucpd_trim_rp_value_t trim_rp_value)
{
  UCPD_TypeDef *p_ucpdx;
  uint32_t dev_id;
  uint32_t rev_id;

  /* UCPD software trimming data pointers - Non-volatile memory location */
  static const __IO uint32_t *pUCPD_TRIM_3A0_CC1 = (uint32_t *)(0x0BFA0545UL); /* Trimming data for Rp 3.0A CC1 */
  static const __IO uint32_t *pUCPD_TRIM_3A0_CC2 = (uint32_t *)(0x0BFA0547UL); /* Trimming data for Rp 3.0A CC2 */
  static const __IO uint32_t *pUCPD_TRIM_1A5_CC1 = (uint32_t *)(0x0BFA07A7UL); /* Trimming data for Rp 1.5A CC1 */
  static const __IO uint32_t *pUCPD_TRIM_1A5_CC2 = (uint32_t *)(0x0BFA07A8UL); /* Trimming data for Rp 1.5A CC2 */

  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Check function parameters */
  ASSERT_DBG_PARAM(IS_UCPD_TRIM_RP(trim_rp_value));

  /* Retrieve device and revision ID */
  dev_id = LL_DBGMCU_GetDeviceID();
  rev_id = LL_DBGMCU_GetRevisionID();

  /* This is only needed for some devices/rev. */
  if (((dev_id == 0x482UL) && (rev_id == 0x3000UL))
      || ((dev_id == 0x481UL) && (rev_id == 0x2001UL))
      || ((dev_id == 0x481UL) && (rev_id == 0x3000UL))
      || ((dev_id == 0x481UL) && (rev_id == 0x3001UL))
      || ((dev_id == 0x476UL) && (rev_id == 0x1000UL)))
  {
    uint32_t trim_val_cc1;
    uint32_t trim_val_cc2;

    /* Retrieve trimming value to apply depending on Rp value */
    if (trim_rp_value == HAL_UCPD_TRIM_RP_3_0A)
    {
      trim_val_cc1 = (((*pUCPD_TRIM_3A0_CC1) & UCPD_VALUE_TRIM_CC1_RP_3A0_MSK) >> UCPD_VALUE_TRIM_CC1_RP_3A0_POS);
      trim_val_cc2 = (((*pUCPD_TRIM_3A0_CC2) & UCPD_VALUE_TRIM_CC2_RP_3A0_MSK) >> UCPD_VALUE_TRIM_CC2_RP_3A0_POS);
    }
    else
    {
      trim_val_cc1 = (((*pUCPD_TRIM_1A5_CC1) & UCPD_VALUE_TRIM_CC1_RP_1A5_MSK) >> UCPD_VALUE_TRIM_CC1_RP_1A5_POS);
      trim_val_cc2 = (((*pUCPD_TRIM_1A5_CC2) & UCPD_VALUE_TRIM_CC2_RP_1A5_MSK) >> UCPD_VALUE_TRIM_CC2_RP_1A5_POS);
    }

    /* Apply Rp trimming on both CC lines */
    LL_UCPD_SetTrimCC1_Rp(p_ucpdx, trim_val_cc1);
    LL_UCPD_SetTrimCC2_Rp(p_ucpdx, trim_val_cc2);
  }

  return HAL_OK;
}

/**
  * @brief  Apply the Rd resistors trimming on both CC lines.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_ApplyTrimmingRd(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;
  uint32_t dev_id;
  uint32_t rev_id;

  /* UCPD software trimming data pointers - Non-volatile memory location */
  static const __IO uint32_t *pUCPD_TRIM_Rd_CC1 = (uint32_t *)(0x0BFA0544UL); /* Trimming data for Rd CC1      */
  static const __IO uint32_t *pUCPD_TRIM_Rd_CC2 = (uint32_t *)(0x0BFA0546UL); /* Trimming data for Rd CC2      */

  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Retrieve device and revision ID */
  dev_id = LL_DBGMCU_GetDeviceID();
  rev_id = LL_DBGMCU_GetRevisionID();

  /* This is only needed for some devices/rev. */
  if (((dev_id == 0x482UL) && (rev_id == 0x3000UL))
      || ((dev_id == 0x481UL) && (rev_id == 0x2001UL))
      || ((dev_id == 0x481UL) && (rev_id == 0x3000UL))
      || ((dev_id == 0x481UL) && (rev_id == 0x3001UL))
      || ((dev_id == 0x476UL) && (rev_id == 0x1000UL)))
  {
    uint32_t trim_val_cc1;
    uint32_t trim_val_cc2;

    /* Retrieve trimming value to apply */
    trim_val_cc1 = (((*pUCPD_TRIM_Rd_CC1) & UCPD_VALUE_TRIM_CC1_RD_MSK) >> UCPD_VALUE_TRIM_CC1_RD_POS);
    trim_val_cc2 = (((*pUCPD_TRIM_Rd_CC2) & UCPD_VALUE_TRIM_CC2_RD_MSK) >> UCPD_VALUE_TRIM_CC2_RD_POS);

    /* Apply Rd trimming on both CC lines */
    LL_UCPD_SetTrimCC1_Rd(p_ucpdx, trim_val_cc1);
    LL_UCPD_SetTrimCC2_Rd(p_ucpdx, trim_val_cc2);
  }

  return HAL_OK;
}

/**
  * @brief  Start the UCPD peripheral.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_Start(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_CONFIGURED);

  /* Enable the UCPD peripheral - Static configuration can no longer be modified */
  LL_UCPD_Enable(p_ucpdx);

  /* Go to idle state */
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  hucpd->previous_state = hucpd->global_state;
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
  hucpd->global_state = HAL_UCPD_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Stop the UCPD peripheral.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_Stop(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

