STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Disable the UCPD peripheral - Static configuration can now be modified. Control configuration will be reset */
  LL_UCPD_Disable(p_ucpdx);

  /* Go to configured state */
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  hucpd->previous_state = hucpd->global_state;
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
  hucpd->global_state = HAL_UCPD_STATE_CONFIGURED;

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup UCPD_Exported_Functions_Group3
  * @{

A set of functions allowing to control the UCPDx peripheral:

- Rx PHY enabling
  - HAL_UCPD_EnableRx()
  - HAL_UCPD_DisableRx()
  - HAL_UCPD_IsEnabledRx()

- Type-C detector
  - HAL_UCPD_EnableTypeCDetectorCCx()
  - HAL_UCPD_DisableTypeCDetectorCCx()
  - HAL_UCPD_IsEnabledTypeCDetectorCCx()

- Vconn discharge
  - HAL_UCPD_EnableVconnDischarge()
  - HAL_UCPD_DisableVconnDischarge()
  - HAL_UCPD_IsEnabledVconnDischarge()

- Tx ordered set
  - HAL_UCPD_SetTxOrderedSet()
  - HAL_UCPD_GetTxOrderedSet()

- Rx/Tx modes
  - HAL_UCPD_SetTxMode()
  - HAL_UCPD_GetTxMode()
  - HAL_UCPD_SetRxMode()
  - HAL_UCPD_GetRxMode()

- PHY operating role
  - HAL_UCPD_SetRole()
  - HAL_UCPD_GetRole()

- Pull-ups (Rp) resistors
  - HAL_UCPD_SetRp()
  - HAL_UCPD_GetRp()

- CC lines
  - HAL_UCPD_SetCCLines()
  - HAL_UCPD_GetCCLines()
  - HAL_UCPD_SetActiveCC()
  - HAL_UCPD_GetActiveCC()

- Fast Role Swap
  - HAL_UCPD_EnableFRS_Rx()
  - HAL_UCPD_DisableFRS_Rx()
  - HAL_UCPD_IsEnabledFRS_Rx()
  - HAL_UCPD_SendFRS()

- Cable reset
  - HAL_UCPD_SendCableReset()

- Hard reset
  - HAL_UCPD_SendHardReset()
  - HAL_UCPD_EnableHardReset_Rx()
  - HAL_UCPD_DisableHardReset_Rx()
  - HAL_UCPD_IsEnabledHardReset_Rx()

  */

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/**
  * @brief  Enable the UCPD PHY receiver.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_EnableRx(hal_ucpd_handle_t *hucpd)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Enable the PHY receiver */
  LL_UCPD_RxEnable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Disable the UCPD PHY receiver.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_DisableRx(hal_ucpd_handle_t *hucpd)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Disable the PHY receiver */
  LL_UCPD_RxDisable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Return the UCPD PHY receiver status.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_rx_phy_status_t UCPD PHY receiver status.
  */
hal_ucpd_rx_phy_status_t HAL_UCPD_IsEnabledRx(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_rx_phy_status_t status;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Return the PHY receiver status */
  status = (hal_ucpd_rx_phy_status_t)LL_UCPD_IsEnabledRx(UCPD_GET_INSTANCE(hucpd));

  return status;
}
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @brief  Enable the UCPD Type-C detector of the given CC line.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  cc_line CC line on which to enable the Type-C detector.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_EnableTypeCDetectorCCx(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_line_t cc_line)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM(IS_UCPD_CC_LINE(cc_line));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Enable Type-C detector and interrupt depending on selected CCx pin */
  if (cc_line == HAL_UCPD_LINE_CC1)
  {
    LL_UCPD_TypeCDetectionCC1Enable(p_ucpdx);
    LL_UCPD_EnableIT_TypeCEventCC1(p_ucpdx);
  }
  else
  {
    LL_UCPD_TypeCDetectionCC2Enable(p_ucpdx);
    LL_UCPD_EnableIT_TypeCEventCC2(p_ucpdx);
  }

  return HAL_OK;
}

/**
  * @brief  Disable the UCPD Type-C detector of the given CC line.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  cc_line CC line on which to disable the Type-C detector.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_DisableTypeCDetectorCCx(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_line_t cc_line)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM(IS_UCPD_CC_LINE(cc_line));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Disable Type-C detector and interrupt depending on selected CCx pin */
  if (cc_line == HAL_UCPD_LINE_CC1)
  {
    LL_UCPD_TypeCDetectionCC1Disable(p_ucpdx);
    LL_UCPD_DisableIT_TypeCEventCC1(p_ucpdx);
  }
  else
  {
    LL_UCPD_TypeCDetectionCC2Disable(p_ucpdx);
    LL_UCPD_DisableIT_TypeCEventCC2(p_ucpdx);
  }

  return HAL_OK;
}

/**
  * @brief  Return the UCPD Type-C detector status of the given CC line.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  cc_line CC line on which to check the status of the Type-C detector.
  * @return @ref hal_ucpd_type_c_detector_status_t UCPD Type-C detector status.
  */
hal_ucpd_type_c_detector_status_t HAL_UCPD_IsEnabledTypeCDetectorCCx(hal_ucpd_handle_t *hucpd,
                                                                     hal_ucpd_cc_line_t cc_line)
{
  UCPD_TypeDef *p_ucpdx;
  hal_ucpd_type_c_detector_status_t status;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM(IS_UCPD_CC_LINE(cc_line));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

