STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Return Type-C detector status depending on selected CCx pin */
  if (cc_line == HAL_UCPD_LINE_CC1)
  {
    status = (hal_ucpd_type_c_detector_status_t)LL_UCPD_IsEnabledTypeCDetectionCC1(p_ucpdx);
  }
  else
  {
    status = (hal_ucpd_type_c_detector_status_t)LL_UCPD_IsEnabledTypeCDetectionCC2(p_ucpdx);
  }

  return status;
}

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/**
  * @brief  Enable the UCPD Vconn discharge.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_EnableVconnDischarge(hal_ucpd_handle_t *hucpd)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Enable Vconn discharge */
  LL_UCPD_VconnDischargeEnable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Disable the UCPD Vconn discharge.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_DisableVconnDischarge(hal_ucpd_handle_t *hucpd)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Disable Vconn discharge */
  LL_UCPD_VconnDischargeDisable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Return the UCPD Vconn discharge status.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_vconn_discharge_status_t UCPD Type-C detector status.
  */
hal_ucpd_vconn_discharge_status_t HAL_UCPD_IsEnabledVconnDischarge(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_vconn_discharge_status_t status;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Return Vconn discharge status */
  status = (hal_ucpd_vconn_discharge_status_t)LL_UCPD_IsEnabledVconnDischarge(UCPD_GET_INSTANCE(hucpd));

  return status;
}

/**
  * @brief  Set the type of ordered set to transmit.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  tx_ordered_set Ordered set type to transmit.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_SetTxOrderedSet(hal_ucpd_handle_t *hucpd, hal_ucpd_tx_ordered_set_t tx_ordered_set)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM(IS_UCPD_TXORDSET_TYPE(tx_ordered_set));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_IDLE | HAL_UCPD_STATE_RX);

  /* Set the Tx message type */
  LL_UCPD_WriteTxOrderSet(UCPD_GET_INSTANCE(hucpd), (uint32_t)tx_ordered_set);

  return HAL_OK;
}

/**
  * @brief  Get the type of ordered set to transmit.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_tx_ordered_set_t The ordered set type to transmit.
  */
hal_ucpd_tx_ordered_set_t HAL_UCPD_GetTxOrderedSet(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_tx_ordered_set_t tx_ordered_set;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Set the Tx message type */
  tx_ordered_set = (hal_ucpd_tx_ordered_set_t)LL_UCPD_ReadTxOrderSet(UCPD_GET_INSTANCE(hucpd));

  return tx_ordered_set;
}

/**
  * @brief  Set the transmission mode.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  tx_mode Transmission mode.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_SetTxMode(hal_ucpd_handle_t *hucpd, hal_ucpd_tx_mode_t tx_mode)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM(IS_UCPD_TX_MODE(tx_mode));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Set the transmission mode */
  LL_UCPD_SetTxMode(UCPD_GET_INSTANCE(hucpd), (uint32_t)tx_mode);

  return HAL_OK;
}

/**
  * @brief  Get the transmission mode.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_tx_mode_t Transmission mode.
  */
hal_ucpd_tx_mode_t HAL_UCPD_GetTxMode(hal_ucpd_handle_t *hucpd)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get the transmission mode */
  return (hal_ucpd_tx_mode_t)LL_UCPD_GetTxMode(UCPD_GET_INSTANCE(hucpd));
}

/**
  * @brief  Set the reception mode.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  rx_mode Reception mode.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_SetRxMode(hal_ucpd_handle_t *hucpd, hal_ucpd_rx_mode_t rx_mode)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM(IS_UCPD_RX_MODE(rx_mode));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Set the reception mode */
  LL_UCPD_SetRxMode(UCPD_GET_INSTANCE(hucpd), (uint32_t)rx_mode);

  return HAL_OK;
}

/**
  * @brief  Get the reception mode.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_rx_mode_t Reception mode.
  */
hal_ucpd_rx_mode_t HAL_UCPD_GetRxMode(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_rx_mode_t mode;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get the reception mode */
  mode = (hal_ucpd_rx_mode_t)LL_UCPD_GetRxMode(UCPD_GET_INSTANCE(hucpd));

  return mode;
}
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @brief  Set the analog PHY operating role.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  role Source or sink role.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_SetRole(hal_ucpd_handle_t *hucpd, hal_ucpd_role_t role)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM(IS_UCPD_ROLE(role));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Set the analog PHY operating role */
  LL_UCPD_SetRole(UCPD_GET_INSTANCE(hucpd), (uint32_t)role);

  return HAL_OK;
}

/**
  * @brief  Get the analog PHY operating role.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_role_t Analog PHY operating role.
  */
hal_ucpd_role_t HAL_UCPD_GetRole(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_role_t role;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get the analog PHY operating role */
  role = (hal_ucpd_role_t)LL_UCPD_GetRole(UCPD_GET_INSTANCE(hucpd));

  return role;
}

/**
  * @brief  Set Rp resistors to signal the device's power requirements to the host.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  rp_value Rp value to set.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_SetRp(hal_ucpd_handle_t *hucpd, hal_ucpd_rp_value_t rp_value)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM(IS_UCPD_RP_VALUE(rp_value));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

