STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  /* Set the Rp resistors */
  LL_UCPD_SetRpResistor(UCPD_GET_INSTANCE(hucpd), (uint32_t)rp_value);

  return HAL_OK;
}

/**
  * @brief  Get the Rp resistors value.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_rp_value_t Rp value.
  */
hal_ucpd_rp_value_t HAL_UCPD_GetRp(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_rp_value_t rp_value;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get the Rp resistors value */
  rp_value = (hal_ucpd_rp_value_t)LL_UCPD_GetRpResistor(UCPD_GET_INSTANCE(hucpd));

  return rp_value;
}

/**
  * @brief  Set which CC line(s) is(are) enabled.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  cc_enable CC line(s) to enable.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_SetCCLines(hal_ucpd_handle_t *hucpd, const hal_ucpd_cc_enable_t cc_enable)
{
  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Check function parameters */
  ASSERT_DBG_PARAM(IS_UCPD_CC_LINE_EN(cc_enable));

  /* Enable or disable the CC line */
  LL_UCPD_SetCCEnable(UCPD_GET_INSTANCE(hucpd), (uint32_t)cc_enable);

  return HAL_OK;
}

/**
  * @brief  Get which CC line(s) is(are) enabled.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_cc_enable_t Enabled CC line(s).
  */
hal_ucpd_cc_enable_t HAL_UCPD_GetCCLines(const hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_cc_enable_t cc_enable;

  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get the CC line enable status */
  cc_enable = (hal_ucpd_cc_enable_t)LL_UCPD_GetCCEnable(UCPD_GET_INSTANCE(hucpd));

  return cc_enable;
}

/**
  * @brief  Set the active CC line.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  cc_line Active CC line to set.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_SetActiveCC(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_line_t cc_line)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM(IS_UCPD_CC_LINE(cc_line));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Set the active CC line */
  LL_UCPD_SetCCPin(UCPD_GET_INSTANCE(hucpd), (uint32_t)cc_line);

  return HAL_OK;
}

/**
  * @brief  Get the active CC line.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_cc_line_t Active CC line.
  */
hal_ucpd_cc_line_t HAL_UCPD_GetActiveCC(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_cc_line_t cc_line;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get the active CC line */
  cc_line = (hal_ucpd_cc_line_t)LL_UCPD_GetCCPin(UCPD_GET_INSTANCE(hucpd));

  return cc_line;
}

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/**
  * @brief  Enable the detection of Fast Role Swap reception.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_EnableFRS_Rx(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Enable Fast Role Swap Rx detection */
  LL_UCPD_FRSDetectionEnable(p_ucpdx);

  /* Enable FRS interrupt */
  LL_UCPD_EnableIT_FRS(p_ucpdx);

  return HAL_OK;
}

/**
  * @brief  Disable the detection of Fast Role Swap reception.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_DisableFRS_Rx(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Disable Fast Role Swap Rx detection */
  LL_UCPD_FRSDetectionDisable(p_ucpdx);

  /* Disable FRS interrupt */
  LL_UCPD_DisableIT_FRS(p_ucpdx);

  return HAL_OK;
}

/**
  * @brief  Return the detection of Fast Role Swap reception status.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_frs_rx_status_t Fast Role Swap reception status.
  */
hal_ucpd_frs_rx_status_t HAL_UCPD_IsEnabledFRS_Rx(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_frs_rx_status_t status;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  status = (hal_ucpd_frs_rx_status_t)LL_UCPD_IsEnabledFRSDetection(UCPD_GET_INSTANCE(hucpd));

  return status;
}

/**
  * @brief  Send a Fast Role Swap to the port partner.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD Fast Role Swap has been correctly initiated.
  */
hal_status_t HAL_UCPD_SendFRS(hal_ucpd_handle_t *hucpd)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Send Fast Role Swap */
  LL_UCPD_SignalFRSTX(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Send a cable reset to the cable.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD cable reset has been correctly initiated.
  */
hal_status_t HAL_UCPD_SendCableReset(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_IDLE | HAL_UCPD_STATE_RX);

