STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Switch state */
  UCPD_CHECK_UPDATE_STATE(hucpd, global_state, ((uint32_t)HAL_UCPD_STATE_IDLE | (uint32_t)HAL_UCPD_STATE_RX),
                          HAL_UCPD_STATE_TX, previous_state);

  /* Enable required interrupt */
  LL_UCPD_EnableIT_TxMSGSENT(p_ucpdx);

  /* Change Tx mode to cable reset */
  LL_UCPD_SetTxMode(p_ucpdx, LL_UCPD_TXMODE_CABLE_RESET);

  /* Send the cable reset */
  LL_UCPD_SendMessage(p_ucpdx);

  return HAL_OK;
}

/**
  * @brief  Send a hard reset to the port partner.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD hard reset has been correctly initiated.
  */
hal_status_t HAL_UCPD_SendHardReset(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Enable hard reset sent and discarded interrupts */
  LL_UCPD_EnableIT_TxHRSTSENT(p_ucpdx);
  LL_UCPD_EnableIT_TxHRSTDISC(p_ucpdx);

  /* Send hard reset */
  LL_UCPD_SendHardReset(p_ucpdx);

  return HAL_OK;
}

/**
  * @brief  Enable hard reset reception.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_EnableHardReset_Rx(hal_ucpd_handle_t *hucpd)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Enable the PHY receiver */
  LL_UCPD_RxEnable(UCPD_GET_INSTANCE(hucpd));

  /* Enable hard reset received interrupt */
  LL_UCPD_EnableIT_RxHRST(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Enable hard reset reception.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD instance has been correctly configured.
  */
hal_status_t HAL_UCPD_DisableHardReset_Rx(hal_ucpd_handle_t *hucpd)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_ACTIVE);

  /* Disable the PHY receiver */
  LL_UCPD_RxDisable(UCPD_GET_INSTANCE(hucpd));

  /* Disable hard reset received interrupt */
  LL_UCPD_DisableIT_RxHRST(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}

/**
  * @brief  Return hard reset reception status.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_hard_reset_rx_status_t Hard reset reception status.
  */
hal_ucpd_hard_reset_rx_status_t HAL_UCPD_IsEnabledHardReset_Rx(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_hard_reset_rx_status_t status;

  /* Check the UCPD handle and parameters allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get hard reset reception status */
  status = (hal_ucpd_hard_reset_rx_status_t)LL_UCPD_IsEnabledIT_RxHRST(UCPD_GET_INSTANCE(hucpd));

  return status;
}

/**
  * @brief  Start sending a BIST test sequence (BIST Carrier Mode 2).
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_BUSY Concurrent process ongoing.
  * @retval HAL_OK   UCPD test sequence has been correctly initiated.
  */
hal_status_t HAL_UCPD_SendBIST(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_IDLE);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Switch state */
  UCPD_CHECK_UPDATE_STATE(hucpd, global_state, (uint32_t)HAL_UCPD_STATE_IDLE, HAL_UCPD_STATE_TX, previous_state);

  /* Set Tx mode */
  LL_UCPD_SetTxMode(p_ucpdx, LL_UCPD_TXMODE_BIST_CARRIER2);

  /* Start BIST sequence */
  LL_UCPD_SendMessage(p_ucpdx);

  return HAL_OK;
}

/**
  * @brief  Stop BIST test sequence (BIST Carrier Mode 2) sending.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval HAL_OK UCPD test sequence has been correctly stopped.
  */
hal_status_t HAL_UCPD_StopBIST(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;
  uint32_t reg_cr;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_TX);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Save context - except TXMODE and TXSEND */
  reg_cr = LL_UCPD_READ_REG(p_ucpdx, CR);
  CLEAR_BIT(reg_cr, (UCPD_CR_TXMODE | UCPD_CR_TXSEND));

  /* Stop BIST sequence */
  LL_UCPD_Disable(p_ucpdx);

  /* Restore context */
  LL_UCPD_Enable(p_ucpdx);
  LL_UCPD_WRITE_REG(p_ucpdx, CR, reg_cr);

  /* Switch state */
  hucpd->previous_state = hucpd->global_state;
  hucpd->global_state   = HAL_UCPD_STATE_IDLE;

  return HAL_OK;
}
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @}
  */

/** @addtogroup UCPD_Exported_Functions_Group4
  * @{

A set of functions related to UCPDx peripheral status:

- CC line voltage status
  - HAL_UCPD_GetTypeCVoltageLevelCCx()

- Detected Rx ordered set
  - HAL_UCPD_GetDetectedRxOrderedSet()

  */

/**
  * @brief  Get the voltage state on CCx line.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  cc_line CC line of type @ref hal_ucpd_cc_line_t structure.
  * @return @ref hal_ucpd_vstate_t Voltage state on given CC line.
  */
hal_ucpd_vstate_t HAL_UCPD_GetTypeCVoltageLevelCCx(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_line_t cc_line)
{
  UCPD_TypeDef *p_ucpdx;
  hal_ucpd_vstate_t vstate;
  uint32_t ll_vstate;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM(IS_UCPD_CC_LINE(cc_line));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

