STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Get the voltage level on the given CC line */
  if (cc_line == HAL_UCPD_LINE_CC1)
  {
    ll_vstate = LL_UCPD_GetTypeCVstateCC1(p_ucpdx);

    /* Interpret the corresponding resistor connected to the CC line depending on the current role */
    if (ll_vstate == LL_UCPD_CC1_VSTATE_LOWEST)
    {
      vstate = (LL_UCPD_GetRole(p_ucpdx) == LL_UCPD_ROLE_SRC) ? HAL_UCPD_VSTATE_SRC_VRA : HAL_UCPD_VSTATE_SNK_VRA;
    }
    else if (ll_vstate == LL_UCPD_CC1_VSTATE_LOW)
    {
      vstate = (LL_UCPD_GetRole(p_ucpdx) == LL_UCPD_ROLE_SRC) ? HAL_UCPD_VSTATE_SRC_VRD : HAL_UCPD_VSTATE_SNK_VRPDFLT;
    }
    else if (ll_vstate == LL_UCPD_CC1_VSTATE_HIGH)
    {
      vstate = (LL_UCPD_GetRole(p_ucpdx) == LL_UCPD_ROLE_SRC) ? HAL_UCPD_VSTATE_SRC_VOPEN : HAL_UCPD_VSTATE_SNK_VRP15A;
    }
    else /* ll_vstate == LL_UCPD_CC1_VSTATE_HIGHEST */
    {
      vstate = (LL_UCPD_GetRole(p_ucpdx) == LL_UCPD_ROLE_SRC) ?
               HAL_UCPD_VSTATE_SRC_INVALID : HAL_UCPD_VSTATE_SNK_VRP30A;
    }
  }
  else
  {
    ll_vstate = LL_UCPD_GetTypeCVstateCC2(p_ucpdx);

    /* Interpret the corresponding resistor connected to the CC line depending on the current role */
    if (ll_vstate == LL_UCPD_CC2_VSTATE_LOWEST)
    {
      vstate = (LL_UCPD_GetRole(p_ucpdx) == LL_UCPD_ROLE_SRC) ? HAL_UCPD_VSTATE_SRC_VRA : HAL_UCPD_VSTATE_SNK_VRA;
    }
    else if (ll_vstate == LL_UCPD_CC2_VSTATE_LOW)
    {
      vstate = (LL_UCPD_GetRole(p_ucpdx) == LL_UCPD_ROLE_SRC) ? HAL_UCPD_VSTATE_SRC_VRD : HAL_UCPD_VSTATE_SNK_VRPDFLT;
    }
    else if (ll_vstate == LL_UCPD_CC2_VSTATE_HIGH)
    {
      vstate = (LL_UCPD_GetRole(p_ucpdx) == LL_UCPD_ROLE_SRC) ? HAL_UCPD_VSTATE_SRC_VOPEN : HAL_UCPD_VSTATE_SNK_VRP15A;
    }
    else /* ll_vstate == LL_UCPD_CC2_VSTATE_HIGHEST */
    {
      vstate = (LL_UCPD_GetRole(p_ucpdx) == LL_UCPD_ROLE_SRC) ?
               HAL_UCPD_VSTATE_SRC_INVALID : HAL_UCPD_VSTATE_SNK_VRP30A;
    }
  }

  /* Return the interpreted voltage state */
  return vstate;
}


#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/**
  * @brief  Get the detected type of received ordered set.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @return @ref hal_ucpd_detected_rx_ordered_set_t The detected ordered set.
  */
hal_ucpd_detected_rx_ordered_set_t HAL_UCPD_GetDetectedRxOrderedSet(hal_ucpd_handle_t *hucpd)
{
  hal_ucpd_detected_rx_ordered_set_t rx_ordered_set;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Set the Tx message type */
  rx_ordered_set = (hal_ucpd_detected_rx_ordered_set_t)LL_UCPD_ReadRxOrderSet(UCPD_GET_INSTANCE(hucpd));

  return rx_ordered_set;
}
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @}
  */

/** @addtogroup UCPD_Exported_Functions_Group5
  * @{

A set of functions allowing to manage data transfer:

- DMA operations
  - HAL_UCPD_Transmit_DMA()
  - HAL_UCPD_Receive_DMA()

- Abort
  - HAL_UCPD_Abort_IT()

- GoodCRC preparation
  - HAL_UCPD_SetGoodCRCData()

  */

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/**
  * @brief  Send an amount of data in DMA mode.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_data Pointer to data buffer.
  * @param  size_byte Amount of bytes to be sent (min 2).
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Tx DMA handle not set.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_UCPD_Transmit_DMA(hal_ucpd_handle_t *hucpd, const void *p_data, uint32_t size_byte)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hucpd != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(IS_UCPD_TRANSFER_SIZE(size_byte));

  ASSERT_DBG_PARAM(hucpd->hdma_tx != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_IDLE | HAL_UCPD_STATE_RX);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check input parameters */
  if ((p_data == NULL) || (size_byte < HAL_UCPD_MIN_MESSAGE_SIZE))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Switch state */
  UCPD_CHECK_UPDATE_STATE(hucpd, global_state, ((uint32_t)HAL_UCPD_STATE_IDLE | (uint32_t)HAL_UCPD_STATE_RX),
                          HAL_UCPD_STATE_TX, previous_state);

  /* Set the transfer information */
  hucpd->p_buf_tx          = (const uint8_t *)p_data;
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
  hucpd->last_error_codes  = HAL_UCPD_ERROR_NONE;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

  if (hucpd->hdma_tx != NULL)
  {
    /* Set the UCPD DMA transfer complete callback */
    hucpd->hdma_tx->p_xfer_cplt_cb = UCPD_DMATransmitCplt;

    /* Unused DMA half transfer complete callback */
    hucpd->hdma_tx->p_xfer_halfcplt_cb = NULL;

    /* Set the DMA error callback */
    hucpd->hdma_tx->p_xfer_error_cb = UCPD_DMAError;

    /* Set the DMA abort callback */
    hucpd->hdma_tx->p_xfer_abort_cb = NULL;

    /* Start DMA */
    if (HAL_DMA_StartPeriphXfer_IT_Opt(hucpd->hdma_tx, (uint32_t)hucpd->p_buf_tx,
                                       (uint32_t)&p_ucpdx->TXDR, size_byte, HAL_DMA_OPT_IT_NONE) != HAL_OK)
    {
      /* Handle the error */
      hucpd->previous_state = hucpd->global_state;
      hucpd->global_state = HAL_UCPD_STATE_IDLE;
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
      hucpd->last_error_codes |= HAL_UCPD_ERROR_DMA;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */
      return HAL_ERROR;
    }
  }

  /* Enable UCPD Tx DMA */
  LL_UCPD_TxDMAEnable(p_ucpdx);

  /* Enable required interrupts */
  LL_UCPD_EnableIT_TxMSGDISC(p_ucpdx);
  LL_UCPD_EnableIT_TxMSGABT(p_ucpdx);
  LL_UCPD_EnableIT_TxUND(p_ucpdx);

  /* Write payload size to transmit */
  LL_UCPD_WriteTxPaySize(p_ucpdx, size_byte);

  /* Send message */
  LL_UCPD_SendMessage(p_ucpdx);

  return HAL_OK;
}

/**
  * @brief  Receive an amount of data in DMA mode, and send GoodCRC message after end of reception.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_data Pointer to data buffer.
  * @param  size_byte Amount of bytes to be received (min 2).
  * @note   This procedure also configure the Tx DMA to be ready for GoodCRC transmission after the end of reception.
  *         At reception completion, HAL_UCPD_RxCpltCallback() is executed and users can add their own code by
  *         customization of function pointer HAL_UCPD_RxCpltCallback(). At this point user must prepare the GoodCRC
  *         data to send by calling HAL_UCPD_SetGoodCRCData().
  *         After returning from HAL_UCPD_RxCpltCallback(), quick transmission of GoodCRC message will occur in the
  *         interrupt context.
  *         At GoodCRC transmission end of transfer, HAL_UCPD_TxGoodCRCCpltCallback() is executed and users can add
  *         their own code by customization of function pointer HAL_UCPD_TxGoodCRCCpltCallback().
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Rx DMA handle not set.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_UCPD_Receive_DMA(hal_ucpd_handle_t *hucpd, void *p_data, uint32_t size_byte)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hucpd != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(IS_UCPD_TRANSFER_SIZE(size_byte));

  ASSERT_DBG_PARAM(hucpd->hdma_rx != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, HAL_UCPD_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check input parameters */
  if ((p_data == NULL) || (size_byte < HAL_UCPD_MIN_MESSAGE_SIZE))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

