STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Switch state */
  UCPD_CHECK_UPDATE_STATE(hucpd, global_state, HAL_UCPD_STATE_IDLE, HAL_UCPD_STATE_RX, previous_state);

  hucpd->p_buf_rx = (uint8_t *)p_data;

  if (hucpd->hdma_rx != NULL)
  {
    /* Set the UCPD DMA transfer complete callback */
    hucpd->hdma_rx->p_xfer_cplt_cb = UCPD_DMAReceiveCplt;

    /* Unused DMA half transfer complete callback */
    hucpd->hdma_rx->p_xfer_halfcplt_cb = NULL;

    /* Set the DMA error callback */
    hucpd->hdma_rx->p_xfer_error_cb = UCPD_DMAError;

    /* Set the DMA abort callback */
    hucpd->hdma_rx->p_xfer_abort_cb = NULL;

    /* Start DMA */
    if (HAL_DMA_StartPeriphXfer_IT_Opt(hucpd->hdma_rx, (uint32_t)&p_ucpdx->RXDR,
                                       (uint32_t)hucpd->p_buf_rx, size_byte, HAL_DMA_OPT_IT_NONE) != HAL_OK)
    {
      /* Handle the error */
      hucpd->previous_state = hucpd->global_state;
      hucpd->global_state = HAL_UCPD_STATE_IDLE;
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
      hucpd->last_error_codes |= HAL_UCPD_ERROR_DMA;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */
      return HAL_ERROR;
    }
  }

  /* Prepare future transmission of GoodCRC if not done previously */
  if (hucpd->hdma_tx != NULL)
  {
    /* Set the UCPD DMA transfer complete callback */
    hucpd->hdma_tx->p_xfer_cplt_cb = UCPD_DMATransmitCplt;

    /* Unused DMA half transfer complete callback */
    hucpd->hdma_tx->p_xfer_halfcplt_cb = NULL;

    /* Set the DMA error callback */
    hucpd->hdma_tx->p_xfer_error_cb = UCPD_DMAError;

    /* Set the DMA abort callback */
    hucpd->hdma_tx->p_xfer_abort_cb = NULL;

    /* Start DMA */
    if (HAL_DMA_StartPeriphXfer_IT_Opt(hucpd->hdma_tx, (uint32_t)&hucpd->buff_goodcrc,
                                       (uint32_t)&p_ucpdx->TXDR, HAL_UCPD_GOODCRC_SIZE, HAL_DMA_OPT_IT_NONE) != HAL_OK)
    {
      /* Handle the error */
      hucpd->previous_state = hucpd->global_state;
      hucpd->global_state = HAL_UCPD_STATE_IDLE;
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
      hucpd->last_error_codes |= HAL_UCPD_ERROR_DMA;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */
      return HAL_ERROR;
    }

    /* Enable required interrupts */
    LL_UCPD_EnableIT_TxMSGDISC(p_ucpdx);
    LL_UCPD_EnableIT_TxMSGABT(p_ucpdx);
    LL_UCPD_EnableIT_TxUND(p_ucpdx);
  }

  /* Enable UCPD Rx DMA */
  LL_UCPD_RxDMAEnable(p_ucpdx);

  /* Enable required interrupts */
  LL_UCPD_EnableIT_RxOvr(p_ucpdx);
  LL_UCPD_EnableIT_RxMsgEnd(p_ucpdx);

  /* Enable the PHY receiver */
  LL_UCPD_RxEnable(p_ucpdx);

  return HAL_OK;
}

/**
  * @brief  Abort ongoing transfers (Interrupt mode).
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @note   This procedure could be used for aborting any ongoing transfer started in DMA mode.
  *         This procedure performs following operations:
  *           - Disable UCPD interrupts (Tx and Rx)
  *           - Enable UCPD message sent interrupt (Tx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT() (in case of transfer in DMA mode)
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @note   In case of Tx abort, the UCPD peripheral continues to send the remaining data but will ensure the CRC
  *         is incorrect, so that the receiver can end the reception and discard the message.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_UCPD_Abort_IT(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;
  uint32_t abort_cplt = 1U;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT_AND_ABORT);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Disable Rx and Tx UCPD interrupts */
  LL_UCPD_DisableIT_RxOvr(p_ucpdx);
  LL_UCPD_DisableIT_RxMsgEnd(p_ucpdx);
  LL_UCPD_DisableIT_TxUND(p_ucpdx);
  LL_UCPD_DisableIT_TxMSGABT(p_ucpdx);
  LL_UCPD_DisableIT_TxMSGDISC(p_ucpdx);

  /* Enable TXMGSENT interrupt to signal end of abort */
  LL_UCPD_EnableIT_TxMSGSENT(p_ucpdx);

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  hucpd->previous_state = hucpd->global_state;
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
  hucpd->global_state = HAL_UCPD_STATE_ABORT;

  if (hucpd->hdma_tx != NULL)
  {
    LL_UCPD_TxDMADisable(p_ucpdx);
    if (hucpd->hdma_tx->global_state == HAL_DMA_STATE_ACTIVE)
    {
      hucpd->hdma_tx->p_xfer_abort_cb = UCPD_DMATxAbortCallback;
      /* Abort DMA Tx */
      if (HAL_DMA_Abort_IT(hucpd->hdma_tx) != HAL_OK)
      {
        hucpd->hdma_tx->p_xfer_abort_cb = NULL;
      }
      else
      {
        abort_cplt = 0U;
      }
    }
  }

  if (hucpd->hdma_rx != NULL)
  {
    LL_UCPD_RxDMADisable(p_ucpdx);
    if (hucpd->hdma_rx->global_state == HAL_DMA_STATE_ACTIVE)
    {
      hucpd->hdma_rx->p_xfer_abort_cb = UCPD_DMARxAbortCallback;
      /* Abort DMA Rx */
      if (HAL_DMA_Abort_IT(hucpd->hdma_rx) != HAL_OK)
      {
        hucpd->hdma_rx->p_xfer_abort_cb = NULL;
      }
      else
      {
        abort_cplt = 0U;
      }
    }
  }

  /* If no DMA abort complete callback execution is required => call user abort complete callback */
  if (abort_cplt == 1U)
  {
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
    hucpd->previous_state = hucpd->global_state;
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
    hucpd->global_state = HAL_UCPD_STATE_IDLE;

#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
    hucpd->last_error_codes = HAL_UCPD_ERROR_NONE;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

    /* As no DMA to be aborted, call directly user abort complete callback */
#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
    /* Call registered abort complete callback */
    hucpd->p_abort_cplt_cb(hucpd);
#else
    /* Call legacy weak abort complete callback */
    HAL_UCPD_AbortCpltCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
  }
  return HAL_OK;
}

/**
  * @brief  Set the GoodCRC buffer data to transmit after a reception.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure which contains the UCPD instance.
  * @param  goodcrc_data GoodCRC data to transmit (little-endian).
  * @retval HAL_OK buffer has been correctly set.
  */
hal_status_t HAL_UCPD_SetGoodCRCData(hal_ucpd_handle_t *hucpd, uint16_t goodcrc_data)
{
  ASSERT_DBG_PARAM(hucpd != NULL);

