STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  hucpd->buff_goodcrc = goodcrc_data;

  LL_UCPD_TxDMAEnable(UCPD_GET_INSTANCE(hucpd));

  return HAL_OK;
}
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @}
  */

/** @addtogroup UCPD_Exported_Functions_Group6
  * @{

A set of functions allowing interrupts request and callbacks management:

- Interrupt requests
  - HAL_UCPD_IRQHandler()

- Callbacks
  - HAL_UCPD_TxCpltCallback()
  - HAL_UCPD_TxGoodCRCCpltCallback()
  - HAL_UCPD_TxDiscardCallback()
  - HAL_UCPD_TxAbortCallback()
  - HAL_UCPD_RxCpltCallback()
  - HAL_UCPD_RxOrdDetCallback()
  - HAL_UCPD_HRstSentCallback()
  - HAL_UCPD_HRstRxCallback()
  - HAL_UCPD_HRstDiscardCallback()
  - HAL_UCPD_TypeCEventCCxCallback()
  - HAL_UCPD_FRSEvtCallback()
  - HAL_UCPD_AbortCpltCallback()
  - HAL_UCPD_ErrorCallback()

- Callback registering
  - HAL_UCPD_RegisterTxCpltCallback()
  - HAL_UCPD_RegisterTxGoodCRCCpltCallback()
  - HAL_UCPD_RegisterTxDiscardCallback()
  - HAL_UCPD_RegisterTxAbortCallback()
  - HAL_UCPD_RegisterRxCpltCallback()
  - HAL_UCPD_RegisterRxOrdDetCallback()
  - HAL_UCPD_RegisterHRstSentCallback()
  - HAL_UCPD_RegisterHRstRxCallback()
  - HAL_UCPD_RegisterHRstDiscardCallback()
  - HAL_UCPD_RegisterTypeCEventCCxCallback()
  - HAL_UCPD_RegisterFRSEvtCallback()
  - HAL_UCPD_AbortCpltCallback()
  - HAL_UCPD_RegisterErrorCallback()

  */

/**
  * @brief  Handler of the UCPD interrupt request.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
void HAL_UCPD_IRQHandler(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;

  /* Check the handle allocation */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Get current interrupt flags and interrupt sources value */
  uint32_t it_flags_sources = LL_UCPD_READ_REG(p_ucpdx, SR);

  /* Mask the disabled interrupts - including RXERR which is not present in IMR */
  it_flags_sources &= (LL_UCPD_READ_REG(p_ucpdx, IMR) | UCPD_SR_RXERR);

  /* Exit IRQHandler if no active interrupts were raised */
  if (it_flags_sources == 0U)
  {
    return;
  }

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  /* Message transmission discarded --------------------------------------*/
  if ((it_flags_sources & UCPD_SR_TXUND) != 0U)
  {
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
    hucpd->last_error_codes |= HAL_UCPD_ERROR_TXUND;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

    /* Disable TXUND IT */
    LL_UCPD_DisableIT_TxUND(p_ucpdx);

    /* Clear pending flag */
    LL_UCPD_ClearFlag_TxUND(p_ucpdx);

    /* Enable TXMSGSENT IT as an erroneous message is sent in case of underrun */
    LL_UCPD_EnableIT_TxMSGSENT(p_ucpdx);
  }

  /* Rx overrun ----------------------------------------------------------*/
  if ((it_flags_sources & UCPD_SR_RXOVR) != 0U)
  {
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
    hucpd->last_error_codes |= HAL_UCPD_ERROR_RXOVR;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

    /* Clear pending flag */
    LL_UCPD_ClearFlag_RxOvr(p_ucpdx);
  }

  /* Rx message received -------------------------------------------------*/
  if ((it_flags_sources & UCPD_SR_RXMSGEND) != 0U)
  {
    /* Clear pending flag */
    LL_UCPD_ClearFlag_RxMsgEnd(p_ucpdx);

    /* Rx error ------------------------------------------------------------*/
    if ((it_flags_sources & UCPD_SR_RXERR) != 0U)
    {
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
      hucpd->last_error_codes |= HAL_UCPD_ERROR_RXERR;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */
    }
    /* Discard the message if an error was raised */
    else
    {
#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
      /* Call registered Rx complete callback */
      hucpd->p_rx_cptl_cb(hucpd);
#else
      /* Call legacy weak Rx complete callback */
      HAL_UCPD_RxCpltCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */

      /* Send GoodCRC if received message is correct */
      if ((LL_UCPD_IsEnabledTxDMA(p_ucpdx) == 1U)
          && (hucpd->hdma_tx != NULL) && ((it_flags_sources & UCPD_SR_RXERR) == 0U))
      {
        /* Write payload size to transmit */
        LL_UCPD_WriteTxPaySize(p_ucpdx, HAL_UCPD_GOODCRC_SIZE);

        /* Send message */
        LL_UCPD_SendMessage(p_ucpdx);
      }
      else
      {
        if (hucpd->hdma_tx != NULL)
        {
          hucpd->hdma_tx->p_xfer_abort_cb = UCPD_DMATxAbortCallback;

          /* HAL_UCPD_SetGoodCRCData was not called: Abort DMA TX */
          if (HAL_DMA_Abort_IT(hucpd->hdma_tx) != HAL_OK)
          {
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
            /* DMA error */
            hucpd->last_error_codes |= HAL_UCPD_ERROR_DMA;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

            /* Call Directly hucpd->hdma_tx->p_xfer_abort_cb function in case of error */
            hucpd->hdma_tx->p_xfer_abort_cb(hucpd->hdma_tx);
          }
        }
      }
    }
  }

  /* Message transmission discarded --------------------------------------*/
  if ((it_flags_sources & UCPD_SR_TXMSGDISC) != 0U)
  {
    /* Clear pending flag */
    LL_UCPD_ClearFlag_TxMSGDISC(p_ucpdx);

    /* Abort the current Tx DMA process */
    if (hucpd->hdma_tx != NULL)
    {
      /* Set the UCPD DMA Abort callback :
          will lead to call HAL_UCPD_TxDiscardCallback() at end of DMA abort procedure */
      hucpd->hdma_tx->p_xfer_abort_cb = UCPD_DMAEndTxMsgDiscardCallback;

      /* Abort DMA TX */
      if (HAL_DMA_Abort_IT(hucpd->hdma_tx) != HAL_OK)
      {
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
        /* DMA error */
        hucpd->last_error_codes |= HAL_UCPD_ERROR_DMA;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

        /* Call Directly hucpd->hdma_tx->p_xfer_abort_cb function in case of error */
        hucpd->hdma_tx->p_xfer_abort_cb(hucpd->hdma_tx);
      }
    }
  }

  /* Message transmission completed --------------------------------------*/
  if ((it_flags_sources & UCPD_SR_TXMSGSENT) != 0U)
  {
    /* Clear pending flag */
    LL_UCPD_ClearFlag_TxMSGSENT(p_ucpdx);

