STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
    /* End of abort case */
    if (hucpd->global_state == HAL_UCPD_STATE_ABORT)
    {
      /* Clear error flag */
      LL_UCPD_ClearFlag_TxUND(p_ucpdx);

      hucpd->previous_state = HAL_UCPD_STATE_ABORT;
      hucpd->global_state = HAL_UCPD_STATE_IDLE;

#if defined (USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
      hucpd->last_error_codes = HAL_UCPD_ERROR_NONE;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

      hucpd->hdma_tx->p_xfer_abort_cb = NULL;

      /* Check if a Rx Abort process is still ongoing */
      if (hucpd->hdma_rx != NULL)
      {
        if ((hucpd->hdma_rx->global_state != HAL_DMA_STATE_ABORT) || (hucpd->hdma_rx->p_xfer_abort_cb == NULL))
        {
          /* Call user abort complete callback */
#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
          /* Call registered abort complete callback */
          hucpd->p_abort_cplt_cb(hucpd);
#else
          /* Call legacy weak abort complete callback */
          HAL_UCPD_AbortCpltCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
        }
      }
    }

    /* End of GoodCRC transmission case */
    else if (hucpd->global_state == HAL_UCPD_STATE_RX)
    {
      /* Return to previous state */
      hucpd->global_state = hucpd->previous_state;
      hucpd->previous_state = HAL_UCPD_STATE_RX;

#if (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
      /* Call registered Tx GoodCRC Complete callback */
      hucpd->p_tx_goodcrc_cplt_cb(hucpd);
#else
      /* Call legacy weak Tx GoodCRC Complete callback */
      HAL_UCPD_TxGoodCRCCpltCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
    }
    /* End of transmission case */
    else
    {
      /* Clear error flag in case of previous underrun. TXMSGSENT will mark the end of the underrun error */
      LL_UCPD_ClearFlag_TxUND(p_ucpdx);

      /* Reset Tx mode */
      LL_UCPD_SetTxMode(p_ucpdx, LL_UCPD_TXMODE_NORMAL);

      /* Return to previous state */
      hal_ucpd_state_t prev_state = hucpd->previous_state;
      hucpd->previous_state = hucpd->global_state;
      hucpd->global_state = prev_state;

#if (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
      /* Call registered Tx Complete callback */
      hucpd->p_tx_cplt_cb(hucpd);
#else
      /* Call legacy weak Tx Complete callback */
      HAL_UCPD_TxCpltCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
    }
  }

  /* Message transmission abort ------------------------------------------*/
  if ((it_flags_sources & UCPD_SR_TXMSGABT) != 0U)
  {
    /* Clear pending flag */
    LL_UCPD_ClearFlag_TxMSGABT(p_ucpdx);

    /* Abort the current Tx DMA process */
    if (hucpd->hdma_tx != NULL)
    {
      /* Set the UCPD DMA Abort callback :
          will lead to call HAL_UCPD_TxAbortCallback() at end of DMA abort procedure */
      hucpd->hdma_tx->p_xfer_abort_cb = UCPD_DMAEndTxMsgAbortCallback;

      /* Abort DMA Tx */
      if (HAL_DMA_Abort_IT(hucpd->hdma_tx) != HAL_OK)
      {
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
        /* DMA error */
        hucpd->last_error_codes |= HAL_UCPD_ERROR_DMA;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

        /* Call Directly hucpd->hdma_tx->p_xfer_abort_cb function in case of error */
        hucpd->hdma_tx->p_xfer_abort_cb(hucpd->hdma_tx);
      }
    }
  }

  /* Hard reset discarded ------------------------------------------------*/
  if ((it_flags_sources & UCPD_SR_HRSTDISC) != 0U)
  {
    /* Clear pending flag */
    LL_UCPD_ClearFlag_TxHRSTDISC(p_ucpdx);

#if (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
    /* Call registered hard reset discarded callback */
    hucpd->p_hrst_discard_cb(hucpd);
#else
    /* Call legacy weak hard reset discarded callback */
    HAL_UCPD_HRstDiscardCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
  }

  /* Hard reset sent -----------------------------------------------------*/
  if ((it_flags_sources & UCPD_SR_HRSTSENT) != 0U)
  {
    /* Clear pending flag */
    LL_UCPD_ClearFlag_TxHRSTSENT(p_ucpdx);

#if (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
    /* Call registered hard reset sent callback */
    hucpd->p_hrst_sent_cb(hucpd);
#else
    /* Call legacy weak hard reset sent callback */
    HAL_UCPD_HRstSentCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
  }

  /* Receive data register not empty -------------------------------------*/
  /* Not treated as all transfers are done by DMA and RXNE flag is cleared automatically */

  /* Rx ordered set (4 K-codes) detection --------------------------------*/
  if ((it_flags_sources & UCPD_SR_RXORDDET) != 0U)
  {
    /* Clear pending flag */
    LL_UCPD_ClearFlag_RxOrderSet(p_ucpdx);

#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
    /* Call registered Rx ordered set code detected callback */
    hucpd->p_rx_ord_set_cb(hucpd);
#else
    /* Call legacy weak Rx ordered set code detected callback */
    HAL_UCPD_RxOrdDetCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
  }

  /* Rx hard reset detection ---------------------------------------------*/
  if ((it_flags_sources & UCPD_SR_RXHRSTDET) != 0U)
  {
    /* Clear pending flag */
    LL_UCPD_ClearFlag_RxHRST(p_ucpdx);

#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
    /* Call registered Rx hard reset received callback */
    hucpd->p_hrst_rx_cb(hucpd);
#else
    /* Call legacy weak Rx hard reset received callback */
    HAL_UCPD_HRstRxCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
  }
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

  /* Type-C event detected on CCx ----------------------------------------*/
  if (((it_flags_sources & UCPD_SR_TYPECEVT1) != 0U) || ((it_flags_sources & UCPD_SR_TYPECEVT2) != 0U))
  {
    hal_ucpd_cc_line_t line;

    /* If coming from CC1 */
    if ((it_flags_sources & UCPD_SR_TYPECEVT1) != 0U)
    {
      /* If also coming from CC2 */
      if ((it_flags_sources & UCPD_SR_TYPECEVT2) != 0U)
      {
        line = HAL_UCPD_LINE_CC1CC2;
      }
      else
      {
        line = HAL_UCPD_LINE_CC1;
      }
    }
    /* Else coming from CC2 */
    else
    {
      line = HAL_UCPD_LINE_CC2;
    }

    /* Clear pending flag */
    LL_UCPD_ClearFlag_TypeCEventCC1(p_ucpdx);
    LL_UCPD_ClearFlag_TypeCEventCC2(p_ucpdx);

#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
    /* Call registered Type-C event on CC1 callback */
    hucpd->p_type_c_event_ccx_cb(hucpd, line);
#else
    /* Call legacy weak Type-C event on CC1 callback */
    HAL_UCPD_TypeCEventCCxCallback(hucpd, line);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
  }

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)

  /* Fast Role Swap detection --------------------------------------------*/
  if ((it_flags_sources & UCPD_SR_FRSEVT) != 0U)
  {
    /* Clear pending flag */
    LL_UCPD_ClearFlag_FRS(p_ucpdx);

#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
    /* Call registered Fast Role Swap detection callback */
    hucpd->p_frs_evt_cb(hucpd);
#else
    /* Call legacy weak Fast Role Swap detection callback */
    HAL_UCPD_FRSEvtCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
  }
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

  /* Error handling ------------------------------------------------------*/
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
  if (hucpd->last_error_codes != HAL_UCPD_ERROR_NONE)
  {
#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
    /* Call registered error callback */
    hucpd->p_error_cb(hucpd);
#else
    /* Call legacy weak error callback */
    HAL_UCPD_ErrorCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
  }
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */
}

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/**
  * @brief  Callback for Tx message sent.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
__WEAK void HAL_UCPD_TxCpltCallback(hal_ucpd_handle_t *hucpd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_TxCpltCallback() can be implemented in the user file.
   */
}

/**
  * @brief  Callback for Tx GoodCRC message sent.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
__WEAK void HAL_UCPD_TxGoodCRCCpltCallback(hal_ucpd_handle_t *hucpd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_TxGoodCRCCpltCallback() can be implemented in the user file.
   */
}

/**
  * @brief  Callback for Tx message discarded.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
__WEAK void HAL_UCPD_TxDiscardCallback(hal_ucpd_handle_t *hucpd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_TxDiscardCallback() can be implemented in the user file.
   */
}

/**
  * @brief  Callback for Tx message aborted.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
__WEAK void HAL_UCPD_TxAbortCallback(hal_ucpd_handle_t *hucpd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_TxAbortCallback() can be implemented in the user file.
   */
}

/**
  * @brief  Callback for Rx message received.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
__WEAK void HAL_UCPD_RxCpltCallback(hal_ucpd_handle_t *hucpd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_RxCpltCallback() can be implemented in the user file.
   */
}

/**
  * @brief  Callback for Rx ordered set (4 K-codes) detected.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
__WEAK void HAL_UCPD_RxOrdDetCallback(hal_ucpd_handle_t *hucpd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_RxOrdDetCallback() can be implemented in the user file.
   */
}

/**
  * @brief  Callback for hard reset sent.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
__WEAK void HAL_UCPD_HRstSentCallback(hal_ucpd_handle_t *hucpd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_HRstSentCallback() can be implemented in the user file.
   */
}

/**
  * @brief  Callback for Rx hard reset received.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
__WEAK void HAL_UCPD_HRstRxCallback(hal_ucpd_handle_t *hucpd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_HRstRxCallback() can be implemented in the user file.
   */
}

/**
  * @brief  Callback for hard reset discarded.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
__WEAK void HAL_UCPD_HRstDiscardCallback(hal_ucpd_handle_t *hucpd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_HRstDiscardCallback() can be implemented in the user file.
   */
}
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @brief  Callback for Type-C event detection on CCx.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  cc_line CC line of type @ref hal_ucpd_cc_line_t structure.
  */
__WEAK void HAL_UCPD_TypeCEventCCxCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_line_t cc_line)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);
  STM32_UNUSED(cc_line);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_TypeCEventCCxCallback() can be implemented in the user file.
   */
}

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/**
  * @brief  Callback for Fast Role Swap event detection.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
__WEAK void HAL_UCPD_FRSEvtCallback(hal_ucpd_handle_t *hucpd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_FRSEvtCallback() can be implemented in the user file.
   */
}


/**
  * @brief  Abort complete callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
__WEAK void HAL_UCPD_AbortCpltCallback(hal_ucpd_handle_t *hucpd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_AbortCpltCallback() can be implemented in the user file.
   */
}
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @brief  Error callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
__WEAK void HAL_UCPD_ErrorCallback(hal_ucpd_handle_t *hucpd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hucpd);

  /** @note This function must not be modified, when the callback is needed,
            HAL_UCPD_ErrorCallback() can be implemented in the user file.
   */

