STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  /** @note The hucpd handle's last_error_codes parameter is updated by the UCPD processes,
            and the user can use the HAL_UCPD_GetLastErrorCodes() API to verify the most recent error that occurred.
   */
}

#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1U)
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/**
  * @brief  Register the UCPD Tx message sent callback to be used instead of
            the weak HAL_UCPD_TxCpltCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t Tx message sent callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterTxCpltCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

  hucpd->p_tx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UCPD Tx GoodCRC message sent callback to be used instead of
            the weak HAL_UCPD_TxGoodCRCCpltCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t Tx message sent callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterTxGoodCRCCpltCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

  hucpd->p_tx_goodcrc_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UCPD Tx message discarded callback to be used instead of
            the weak HAL_UCPD_TxDiscardCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t Tx message discarded callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterTxDiscardCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

  hucpd->p_tx_discard_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UCPD Tx message aborted callback to be used instead of
            the weak HAL_UCPD_TxAbortCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t Tx message aborted callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterTxAbortCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

  hucpd->p_tx_abort_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UCPD Rx complete callback to be used instead of
            the weak HAL_UCPD_RegisterRxCpltCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t Rx complete callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterRxCpltCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

  hucpd->p_rx_cptl_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UCPD Rx ordered set detected callback to be used instead of
            the weak HAL_UCPD_RegisterRxOrdDetCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t Rx ordered set detected callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterRxOrdDetCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

