STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  hucpd->p_rx_ord_set_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UCPD hard reset sent callback to be used instead of
            the weak HAL_UCPD_HRstSentCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t hard reset sent callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterHRstSentCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

  hucpd->p_hrst_sent_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UCPD hard reset received callback to be used instead of
            the weak HAL_UCPD_RegisterHRstRxCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t hard reset received callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterHRstRxCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

  hucpd->p_hrst_rx_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UCPD hard reset discarded callback to be used instead of
            the weak HAL_UCPD_HRstDiscardCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t hard reset discarded callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterHRstDiscardCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

  hucpd->p_hrst_discard_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @brief  Register the UCPD Type-C event on CCx callback to be used instead of
            the weak HAL_UCPD_RegisterTypeCEventCCxCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t Type-C event on CCx callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterTypeCEventCCxCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_event_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

  hucpd->p_type_c_event_ccx_cb = p_callback;

  return HAL_OK;
}

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/**
  * @brief  Register the UCPD Fast Role Swap event detected callback to be used instead of
            the weak HAL_UCPD_RegisterFRSEvtCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t Fast Role Swap event detected callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterFRSEvtCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

  hucpd->p_frs_evt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UCPD abort complete Callback to be used instead of
            the weak HAL_UCPD_AbortCpltCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t abort complete Callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterAbortCpltCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

  hucpd->p_abort_cplt_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @brief  Register the UCPD Error Callback to be used instead of
            the weak HAL_UCPD_ErrorCallback() predefined callback.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @param  p_callback Pointer to the @ref hal_ucpd_cb_t Error Callback function.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_UCPD_RegisterErrorCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state,
                   HAL_UCPD_STATE_INIT |
                   HAL_UCPD_STATE_IDLE |
                   HAL_UCPD_STATE_CONFIGURED);

