STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  hucpd->p_error_cb = p_callback;

  return HAL_OK;
}

#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup UCPD_Exported_Functions_Group7
  * @{

A set of functions allowing to manage peripheral states and errors:

- HAL_UCPD_GetState()
- HAL_UCPD_GetLastErrorCodes()

  */

/**
  * @brief  Retrieve the HAL UCPD global state.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval hal_ucpd_state_t HAL UCPD global state
  */
hal_ucpd_state_t HAL_UCPD_GetState(const hal_ucpd_handle_t *hucpd)
{
  ASSERT_DBG_PARAM((hucpd != NULL));

  return hucpd->global_state;
}


#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
/**
  * @brief  Retrieve the HAL UCPD last error codes.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  * @retval uint32_t HAL UCPD bit mapped last errors.
  */
uint32_t HAL_UCPD_GetLastErrorCodes(const hal_ucpd_handle_t *hucpd)
{
  ASSERT_DBG_PARAM((hucpd != NULL));

  return hucpd->last_error_codes;
}
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

/**
  * @}
  */


#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @addtogroup UCPD_Exported_Functions_Group8
  * @{

A set of functions allowing to Acquire/Release the bus based on the HAL OS abstraction layer (if USE_HAL_MUTEX == 1):

 - HAL_UCPD_AcquireBus()
 - HAL_UCPD_ReleaseBus()

  */

/**
  * @brief  Acquire the UCPD bus thanks to the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t.
  * @param  timeout_ms Timeout duration in millisecond.
  * @warning This function must be called from thread mode only (not from handler mode i.e from ISR).
  * @retval HAL_ERROR Operation completed with error.
  * @retval HAL_OK    Operation completed successfully.
  */
hal_status_t HAL_UCPD_AcquireBus(hal_ucpd_handle_t *hucpd, uint32_t timeout_ms)
{
  hal_status_t status = HAL_ERROR;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Take the semaphore */
  if (HAL_OS_SemaphoreTake(&hucpd->semaphore, timeout_ms) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Release the UCPD bus thanks to the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t.
  * @note   This function can be called from thread mode or from handler mode i.e from ISR.
  * @retval HAL_ERROR Operation completed with error.
  * @retval HAL_OK    Operation completed successfully.
  */
hal_status_t HAL_UCPD_ReleaseBus(hal_ucpd_handle_t *hucpd)
{
  hal_status_t status = HAL_ERROR;

  /* Check the parameters */
  ASSERT_DBG_PARAM((hucpd != NULL));

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL_EXCEPT_INIT);

  /* Release the semaphore */
  if (HAL_OS_SemaphoreRelease(&hucpd->semaphore) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined(USE_HAL_UCPD_USER_DATA) && (USE_HAL_UCPD_USER_DATA == 1)
/** @addtogroup UCPD_Exported_Functions_Group9
  * @{

A set of functions allowing to manage a user data pointer stored to the UCPD handle:

 - HAL_UCPD_SetUserData()
 - HAL_UCPD_GetUserData()

  */

/**
  * @brief  Set the user data pointer into the handle.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t.
  * @param  p_user_data Pointer to the user data.
  */
void HAL_UCPD_SetUserData(hal_ucpd_handle_t *hucpd, const void *p_user_data)
{

  /* Check the parameters */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL);

  hucpd->p_user_data = p_user_data;
}

/**
  * @brief  Get the user data pointer from the handle.
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t.
  * @retval Pointer to the user data.
  */
const void *HAL_UCPD_GetUserData(const hal_ucpd_handle_t *hucpd)
{

  /* Check the parameters */
  ASSERT_DBG_PARAM(hucpd != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hucpd->global_state, UCPD_STATE_ALL);

  return (hucpd->p_user_data);
}
/**
  * @}
  */
#endif /* USE_HAL_UCPD_USER_DATA */

/**
  * @}
  */

/** @defgroup UCPD_Private_Functions UCPD Private Functions
  * @{
  */

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/**
  * @brief  End ongoing Tx transfer on UCPD peripheral (following error detection or Transmit completion).
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
static void UCPD_EndTxTransfer(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Disable UCPD Tx interrupts */
  LL_UCPD_DisableIT_TxUND(p_ucpdx);
  LL_UCPD_DisableIT_TxHRSTSENT(p_ucpdx);
  LL_UCPD_DisableIT_TxHRSTDISC(p_ucpdx);
  LL_UCPD_DisableIT_TxMSGABT(p_ucpdx);
  LL_UCPD_DisableIT_TxMSGSENT(p_ucpdx);
  LL_UCPD_DisableIT_TxMSGDISC(p_ucpdx);

  hucpd->previous_state = hucpd->global_state;
  hucpd->global_state = HAL_UCPD_STATE_IDLE;
}

/**
  * @brief  End ongoing Rx transfer on UCPD peripheral (following error detection or Reception completion).
  * @param  hucpd Pointer to a @ref hal_ucpd_handle_t structure.
  */
static void UCPD_EndRxTransfer(hal_ucpd_handle_t *hucpd)
{
  UCPD_TypeDef *p_ucpdx;

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Disable UCPD Rx interrupts */
  LL_UCPD_DisableIT_RxMsgEnd(p_ucpdx);
  LL_UCPD_DisableIT_RxOvr(p_ucpdx);
  LL_UCPD_DisableIT_RxHRST(p_ucpdx);
  LL_UCPD_DisableIT_RxOrderSet(p_ucpdx);

  hucpd->previous_state = hucpd->global_state;
  hucpd->global_state = HAL_UCPD_STATE_IDLE;
}

/**
  * @brief  DMA UCPD transmit process complete callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UCPD_DMATransmitCplt(hal_dma_handle_t *hdma)
{
  UCPD_TypeDef *p_ucpdx;

  /* Get the instance associated with the UCPD handle */
  hal_ucpd_handle_t *hucpd = (hal_ucpd_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Enable Tx message sent interrupt */
  LL_UCPD_EnableIT_TxMSGSENT(p_ucpdx);

