STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.c
  /* Disable Tx DMA link */
  LL_UCPD_TxDMADisable(p_ucpdx);
}

/**
  * @brief  DMA UCPD receive process complete callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UCPD_DMAReceiveCplt(hal_dma_handle_t *hdma)
{
  UCPD_TypeDef *p_ucpdx;

  /* Get the instance associated with the UCPD handle */
  hal_ucpd_handle_t *hucpd = (hal_ucpd_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Disable Rx DMA link */
  LL_UCPD_RxDMADisable(p_ucpdx);

  /* Return to IDLE state */
  hucpd->global_state = HAL_UCPD_STATE_IDLE;
}

/**
  * @brief  DMA UCPD communication error callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UCPD_DMAError(hal_dma_handle_t *hdma)
{
  hal_ucpd_handle_t *hucpd = (hal_ucpd_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  hal_ucpd_state_t prev_state;
  UCPD_TypeDef *p_ucpdx;

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Stop UCPD DMA Tx request if ongoing */
  const uint32_t isTxDMAEnabled = LL_UCPD_IsEnabledTxDMA(p_ucpdx);
  if ((hucpd->global_state == HAL_UCPD_STATE_TX) && (isTxDMAEnabled != 0U))
  {
    UCPD_EndTxTransfer(hucpd);
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
    hucpd->last_error_codes |= HAL_UCPD_ERROR_DMA;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */
  }

  /* Check if Rx DMA is enabled */
  const uint32_t isRxDMAEnabled = LL_UCPD_IsEnabledRxDMA(p_ucpdx);
  if ((hucpd->global_state == HAL_UCPD_STATE_RX) && (isRxDMAEnabled != 0U))
  {
    UCPD_EndRxTransfer(hucpd);
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
    hucpd->last_error_codes |= HAL_UCPD_ERROR_DMA;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */
  }

  /* Return to previous state */
  prev_state = hucpd->previous_state;
  hucpd->previous_state = hucpd->global_state;
  hucpd->global_state = prev_state;

#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
  /* Call registered error callback */
  hucpd->p_error_cb(hucpd);
#else
  /* Call legacy weak error callback */
  HAL_UCPD_ErrorCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA UCPD Tx communication abort callback, when initiated by user
  *         (To be called at end of DMA Tx Abort procedure following user abort request).
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  * @note   When this callback is executed, User Abort complete callback is called only if no
  *         Abort still ongoing for Rx DMA Handle.
  */
static void UCPD_DMATxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_ucpd_handle_t *hucpd = (hal_ucpd_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  UCPD_TypeDef *p_ucpdx;

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Clear error flags */
  LL_UCPD_ClearFlag_TxUND(p_ucpdx);
  LL_UCPD_ClearFlag_TxHRSTDISC(p_ucpdx);
  LL_UCPD_ClearFlag_TxMSGABT(p_ucpdx);
  LL_UCPD_ClearFlag_TxMSGDISC(p_ucpdx);

  /* Disable Tx DMA link */
  LL_UCPD_TxDMADisable(p_ucpdx);

  /* The abort will be complete when TXMSGSENT interrupt will rise */
}


/**
  * @brief  DMA UCPD Rx communication abort callback, when initiated by user
  *         (To be called at end of DMA Rx Abort procedure following user abort request).
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  * @note   When this callback is executed, User Abort complete callback is called only if no
  *         Abort still ongoing for Tx DMA Handle.
  */
static void UCPD_DMARxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_ucpd_handle_t *hucpd = (hal_ucpd_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  UCPD_TypeDef *p_ucpdx;

  hucpd->hdma_rx->p_xfer_abort_cb = NULL;
  /* Check if an Abort process is still ongoing */
  if (hucpd->hdma_tx != NULL)
  {
    if ((hucpd->hdma_tx->global_state == HAL_DMA_STATE_ABORT) && (hucpd->hdma_tx->p_xfer_abort_cb != NULL))
    {
      return;
    }
  }

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Clear error flags */
  LL_UCPD_ClearFlag_RxOvr(p_ucpdx);

  /* Disable Rx DMA link */
  LL_UCPD_RxDMADisable(p_ucpdx);

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  hucpd->previous_state = HAL_UCPD_STATE_IDLE;
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
  hucpd->global_state = HAL_UCPD_STATE_IDLE;

#if defined (USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
  hucpd->last_error_codes = HAL_UCPD_ERROR_NONE;
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

  /* Call user abort complete callback */
#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
  /* Call registered abort complete callback */
  hucpd->p_abort_cplt_cb(hucpd);
#else
  /* Call legacy weak abort complete callback */
  HAL_UCPD_AbortCpltCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
}

/**
  * @brief  End ongoing Tx message abort on UCPD peripheral (following TXMSGABT detection).
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UCPD_DMAEndTxMsgAbortCallback(hal_dma_handle_t *hdma)
{
  hal_ucpd_handle_t *hucpd = (hal_ucpd_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  UCPD_TypeDef *p_ucpdx;

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Disable UCPD Tx interrupts */
  LL_UCPD_DisableIT_TxUND(p_ucpdx);
  LL_UCPD_DisableIT_TxMSGABT(p_ucpdx);
  LL_UCPD_DisableIT_TxMSGSENT(p_ucpdx);
  LL_UCPD_DisableIT_TxMSGDISC(p_ucpdx);

  /* Return to previous state */
  hal_ucpd_state_t prev_state = hucpd->previous_state;
  hucpd->previous_state = hucpd->global_state;
  hucpd->global_state = prev_state;

#if (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
  /* Call registered Tx Abort callback */
  hucpd->p_tx_abort_cb(hucpd);
#else
  /* Call legacy weak Tx Abort callback */
  HAL_UCPD_TxAbortCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
}

/**
  * @brief  End ongoing Tx message discard on UCPD peripheral (following TXMSGDISC detection).
  * @param  hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UCPD_DMAEndTxMsgDiscardCallback(hal_dma_handle_t *hdma)
{
  hal_ucpd_handle_t *hucpd = (hal_ucpd_handle_t *)(((hal_dma_handle_t *)hdma)->p_parent);
  UCPD_TypeDef *p_ucpdx;

  /* Get the instance associated with the UCPD handle */
  p_ucpdx = UCPD_GET_INSTANCE(hucpd);

  /* Disable UCPD Tx interrupts */
  LL_UCPD_DisableIT_TxUND(p_ucpdx);
  LL_UCPD_DisableIT_TxMSGABT(p_ucpdx);
  LL_UCPD_DisableIT_TxMSGSENT(p_ucpdx);
  LL_UCPD_DisableIT_TxMSGDISC(p_ucpdx);

  /* Return to previous state */
  hal_ucpd_state_t prev_state = hucpd->previous_state;
  hucpd->previous_state = hucpd->global_state;
  hucpd->global_state = prev_state;

#if (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
  /* Call registered Tx Discard callback */
  hucpd->p_tx_discard_cb(hucpd);
#else
  /* Call legacy weak Tx Discard callback */
  HAL_UCPD_TxDiscardCallback(hucpd);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */
}
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @}
  */

#endif /* USE_HAL_UCPD_MODULE */

/**
  * @}
  */

#endif /* defined(UCPD1) */

/**
  * @}
  */
